[
  {
    "title": "[Launched] Generally Available: Custom port support for Azure Database for MySQL – Flexible Server ",
    "link": "https://azure.microsoft.com/updates?id=503627",
    "description": "You can now configure a custom port (25001–26000) during server creation for both public and private access-enabled servers—enabling you to integrate more easily with existing applications and improve alignment with security postures. By default, MySQL se",
    "pubDate": "2025-10-09T17:30:09.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Firewall updates - Customer provided public IP address support in secured hubs",
    "link": "https://azure.microsoft.com/updates?id=512875",
    "description": "Azure Firewall in Virtual WAN\r\nsecured hubs now supports the use of customer-provided public IP addresses.\r\nThis capability enables organizations to bring their own public IP addresses\r\nwhen deploying Azure Firewall in a secured Virtual WAN hub, providing gr",
    "pubDate": "2025-10-09T17:00:43.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Securing agentic AI: Your guide to the Microsoft Ignite sessions catalog",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/09/securing-agentic-ai-your-guide-to-the-microsoft-ignite-sessions-catalog/",
    "description": "<p>​Security is a core focus at Microsoft Ignite 2025, reflected in dedicated sessions and hands-on experiences designed for security professionals and leaders. Take a look at the session catalog. </p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/09/securing-agentic-ai-your-guide-to-the-microsoft-ignite-sessions-catalog/\">Securing agentic AI: Your guide to the Microsoft Ignite sessions catalog</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-09T16:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "Investigating targeted “payroll pirate” attacks affecting US universities",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/09/investigating-targeted-payroll-pirate-attacks-affecting-us-universities/",
    "description": "<p>Microsoft Threat Intelligence has identified a financially motivated threat actor that we track as Storm-2657 compromising employee accounts to gain unauthorized access to employee profiles and divert salary payments to attacker-controlled accounts, attacks that have been dubbed “payroll pirate”. </p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/09/investigating-targeted-payroll-pirate-attacks-affecting-us-universities/\">Investigating targeted “payroll pirate” attacks affecting US universities</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-09T15:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[Launched] Generally Available: Firmware analysis enabled by Azure Arc ",
    "link": "https://azure.microsoft.com/updates?id=512201",
    "description": "Firmware analysis enabled by Azure Arc is now generally available. Firmware analysis brings deep visibility into the software that powers IoT/OT and network devices—systems that often operate as “black boxes” with limited insight into their security postu",
    "pubDate": "2025-10-09T14:15:20.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Azure AI Health Insights and related models",
    "link": "https://azure.microsoft.com/updates?id=502049",
    "description": " As part of a strategic review of our AI portfolio, Azure AI Health Insights service and the Clinical Trials Matcher and Radiology Insights models will be retired on December 31, 2025, and will no longer be available for use or integration. As a result, e",
    "pubDate": "2025-10-09T12:45:35.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Introducing Vaulted Backup for Azure Data Lake Storage",
    "link": "https://azure.microsoft.com/updates?id=508971",
    "description": "Announcing the Public Preview of Vaulted Backup\r\nfor Azure Data Lake Storage (ADLS)!Azure Backup now\r\nsupports vaulted protection for ADLS, delivering secure, off-site backups that\r\nensure business continuity and compliance—even in cases of accidental deleti",
    "pubDate": "2025-10-09T00:00:23.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Azure Cache for Redis Enterprise is retiring on March 30, 2027",
    "link": "https://azure.microsoft.com/updates?id=499606",
    "description": "Azure Cache for Redis Enterprise and Enterprise Flash tiers is retiring on March 31, 2027 and we recommend you migrate your workloads to use Azure Managed Redis by that date. Starting April 1, 2026, users will not be able to create new instances of Azure ",
    "pubDate": "2025-10-08T23:15:04.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Azure Cache for Redis is retiring on September 30, 2028",
    "link": "https://azure.microsoft.com/updates?id=499577",
    "description": "Azure Cache for Redis (Basic, Standard and Premium) will be retired on September 30, 2028 and we recommend you migrate your workloads to use Azure Managed Redis before September 30, 2028. Azure Cache for Redis instances that are not migrated by September ",
    "pubDate": "2025-10-08T23:15:04.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Azure Network Policy Manager (NPM) for Windows nodes on AKS to Be Retired by September 30, 2026",
    "link": "https://azure.microsoft.com/updates?id=500273",
    "description": "On September 30, 2026, we’ll end support for Azure Network Policy Manager (NPM) on Windows nodes in AKS. To ensure your setup continues to receive support, security updates, and deployment compatibility, please explore alternative options, such as using N",
    "pubDate": "2025-10-07T21:30:21.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Disrupting threats targeting Microsoft Teams",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/07/disrupting-threats-targeting-microsoft-teams/",
    "description": "<p>Threat actors seek to abuse Microsoft Teams features and capabilities across the attack chain, underscoring the importance for defenders to proactively monitor, detect, and respond effectively. In this blog, we recommend countermeasures and optimal controls across identity, endpoints, data apps, and network layers to help strengthen protection for enterprise Teams users.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/07/disrupting-threats-targeting-microsoft-teams/\">Disrupting threats targeting Microsoft Teams</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-07T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[Launched] Generally Available: Azure Firewall Updates - IP Group limit increased to 600 per Firewall Policy ",
    "link": "https://azure.microsoft.com/updates?id=511722",
    "description": "Azure Firewall Policy now supports up to 600 IP Groups per policy, up from the previous limit of 200. This enhancement enables users to: Reduce rule complexity by replacing long lists of IPs with more well-organized IP Groups, making rule sets easier to m",
    "pubDate": "2025-10-07T16:30:20.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "New Microsoft Secure Future Initiative (SFI) patterns and practices: Practical guides to strengthen security",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/07/new-microsoft-secure-future-initiative-sfi-patterns-and-practices-practical-guides-to-strengthen-security/",
    "description": "<p>Microsoft Secure Future Initiative (SFI) patterns and practices are practical, actionable, insights from practitioners for practitioners based on Microsoft’s implementation of Zero Trust through the Microsoft Secure Future Initiatives. By adopting these patterns, organizations can accelerate their security maturity, reduce implementation friction, and build systems that are more secure by design, default, and in operation.  </p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/07/new-microsoft-secure-future-initiative-sfi-patterns-and-practices-practical-guides-to-strengthen-security/\">New Microsoft Secure Future Initiative (SFI) patterns and practices: Practical guides to strengthen security</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-07T16:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[Launched] Generally Avaialbe: Azure NetApp Files short-term clones ",
    "link": "https://azure.microsoft.com/updates?id=503836",
    "description": "Azure NetApp Files short-term clones enable space-efficient, instant read/write access to data by creating temporary thin clones from existing volume snapshots, eliminating the need for full data copies and enabling capacity savings. Ideal for software de",
    "pubDate": "2025-10-07T14:30:18.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Legacy Authentication in Azure Monitor - Container Insights will be retired on September 30, 2026.",
    "link": "https://azure.microsoft.com/updates?id=500853",
    "description": "Legacy Authentication in Azure Monitor - Container\r\nInsights will be retired on September 30, 2026.  Legacy authentication has been replaced by the\r\nmore secure Managed Identity\r\nauthentication method. Migrating to Managed Identity also gives customers\r\nacces",
    "pubDate": "2025-10-07T13:00:16.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: AI toolchain operator add-on (KAITO) for AKS ",
    "link": "https://azure.microsoft.com/updates?id=503263",
    "description": "The AI toolchain operator add-on\r\n(KAITO) is now generally available on AKS, streamlining the deployment of AI\r\ninference and fine-tuning workflows using popular open-source frameworks. With\r\nvLLM as the default inference engine, this addon reduces managemen",
    "pubDate": "2025-10-07T12:00:49.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Inside Microsoft Threat Intelligence: Calm in the chaos",
    "link": "https://www.microsoft.com/en-us/security/security-insider/threat-landscape/inside-microsoft-threat-intelligence-calm-in-chaos#overview-video",
    "description": "<p>Incident response is never orderly. Threat actors don’t wait. Environments are compromised. Data is missing. Confidence is shaken. But for Microsoft’s Incident Response (IR) team, that chaos is exactly where the work begins.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/security-insider/threat-landscape/inside-microsoft-threat-intelligence-calm-in-chaos#overview-video\">Inside Microsoft Threat Intelligence: Calm in the chaos</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-06T21:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[Launched] Generally Available: Latest PostgreSQL minor versions supported by Azure Database for PostgreSQL – Flexible Server ",
    "link": "https://azure.microsoft.com/updates?id=503636",
    "description": "PostgreSQL minor versions 17.6, 16.10, 15.14, 14.19, 13.22, and 18 Beta 3 are now supported by Azure Database for PostgreSQL – Flexible Server.      These minor version upgrades are automatically performed as part of the monthly planned maintenance in Azu",
    "pubDate": "2025-10-06T20:45:03.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Unleash your creativity at scale: Azure AI Foundry’s multimodal revolution",
    "link": "https://azure.microsoft.com/en-us/blog/unleash-your-creativity-at-scale-azure-ai-foundrys-multimodal-revolution/",
    "description": "<p>Imagine a platform where every developer can unlock the full spectrum of AI: text, images, audio, and video. This OpenAI DevDay, Azure AI Foundry is making that vision real. With today’s launch of OpenAI GPT-image-1-mini, GPT-realtime-mini, and GPT-audio-mini, plus major safety upgrades to GPT-5, you now have the ultimate toolkit to create, experiment, and scale multimodal solutions.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/unleash-your-creativity-at-scale-azure-ai-foundrys-multimodal-revolution/\">Unleash your creativity at scale: Azure AI Foundry’s multimodal revolution</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-06T18:03:45.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Investigating active exploitation of CVE-2025-10035 GoAnywhere Managed File Transfer vulnerability",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/06/investigating-active-exploitation-of-cve-2025-10035-goanywhere-managed-file-transfer-vulnerability/",
    "description": "<p>Storm-1175, a financially motivated actor known for deploying Medusa ransomware and exploiting public-facing applications for initial access, was observed exploiting the deserialization vulnerability in GoAnywhere MFT's License Servlet, tracked as CVE-2025-10035. We are publishing this blog post to increase awareness of this threat and to share end-to-end protection coverage details across Microsoft Defender.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/06/investigating-active-exploitation-of-cve-2025-10035-goanywhere-managed-file-transfer-vulnerability/\">Investigating active exploitation of CVE-2025-10035 GoAnywhere Managed File Transfer vulnerability</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-06T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "Retirement: Azure Monitor SCOM Managed Instance will be retired on Sep 30, 2026",
    "link": "https://azure.microsoft.com/updates?id=501673",
    "description": "After\r\nSeptember 30, 2026, customers will no longer be able to access the\r\nservice. Please see our retirement\r\ndocumentation for more details. Recommended\r\naction If\r\nyour goal is to monitor on-premises workloads, please transition to Operations Manager\r\non-pre",
    "pubDate": "2025-10-03T18:15:20.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: CLI command for migration from Availability Sets and basic load balancer on AKS ",
    "link": "https://azure.microsoft.com/updates?id=503258",
    "description": "Availability Sets and the basic load\r\nbalancer are being deprecated on September 30 2025. AKS now supports, a simple\r\nAzure CLI command that will automatically migrate your AKS cluster from\r\nAvailability Sets to the new Virtual Machines node pool and upgrade",
    "pubDate": "2025-10-03T16:45:25.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Cross-tenant customer-managed keys for Azure NetApp Files volume encryption",
    "link": "https://azure.microsoft.com/updates?id=501340",
    "description": "Cross-tenant Customer-Managed Keys (CMK) for Azure NetApp Files volume encryption is now generally available, empowering customers to manage their own encryption keys across different Azure tenancies. This capability enhances control and flexibility in mu",
    "pubDate": "2025-10-03T16:15:04.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Azure Static Web Apps database connection feature",
    "link": "https://azure.microsoft.com/updates?id=500848",
    "description": "Due to changes in underlying infrastructure, the database connections feature of Static Web Apps this feature (currently in public preview), will be deprecated effective November 30, 2025. \r\nTo avoid issues in deployments using this feature you can refacto",
    "pubDate": "2025-10-03T16:15:04.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview:  Azure NetApp Files Support for OpenLDAP, FreeIPA, and Red Hat Directory Server LDAP services    ",
    "link": "https://azure.microsoft.com/updates?id=508748",
    "description": "Azure NetApp Files now supports integration with FreeIPA, OpenLDAP, and Red Hat Directory Server—available in public preview. This LDAP integration enables secure LDAP over TLS connectivity for NFSv3 and NFSv4.1 volumes, allowing enterprises to use these ",
    "pubDate": "2025-10-03T16:01:01.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Azure VPN Gateway support for SSTP Protocol will be retired on March 31, 2027",
    "link": "https://azure.microsoft.com/updates?id=499923",
    "description": "Due to its limited\r\nscalability and suboptimal performance, support for SSTP will be phased out. We\r\nstrongly recommend transitioning to IKEv2 or OpenVPN, which offer\r\nsignificantly enhanced capabilities—including support for up to 10,000\r\nconnections and 10 ",
    "pubDate": "2025-10-03T16:01:01.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: General Purpose v1 (GPv1) and legacy blob storage accounts  ",
    "link": "https://azure.microsoft.com/updates?id=496964",
    "description": "As part of our ongoing efforts to streamline the Azure Storage portfolio and deliver enhanced performance, scalability, and cost efficiency, we are announcing the retirement of all General purpose v1 (GPv1) storage accounts. This includes legacy blob stor",
    "pubDate": "2025-10-03T14:15:21.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "SQL Server on Azure Virtual Machines With Azure NetApp Files",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/file-storage/sql-server-azure-netapp-files",
    "description": "Learn how to implement a high-bandwidth, low-latency solution for SQL Server workloads. Use Azure NetApp Files for enterprise-scale performance and reduced costs.",
    "pubDate": "2025-10-02T20:44:46.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Replicate and Sync Mainframe Data to Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/migration/sync-mainframe-data-with-azure",
    "description": "Learn how to replicate data while you modernize mainframe and midrange systems. Sync on-premises data with Azure data during modernization.",
    "pubDate": "2025-10-02T17:23:53.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Microsoft named a Leader in the IDC MarketScape for XDR",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/02/microsoft-named-a-leader-in-the-idc-marketscape-for-xdr/",
    "description": "<p>Microsoft has been named a Leader in IDC’s inaugural category for Worldwide Extended Detection and Response (XDR) Software for 2025, recognized for its deep integration, intelligent automation, and unified security operations solutions.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/02/microsoft-named-a-leader-in-the-idc-marketscape-for-xdr/\">Microsoft named a Leader in the IDC MarketScape for XDR</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-02T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[Launched] Generally Available: New Health Check infrastructure for Azure Traffic Manager",
    "link": "https://azure.microsoft.com/updates?id=509097",
    "description": "Azure Traffic Manager has\r\nintroduced new health check infrastructure to improve the resiliency and\r\nscalability of the service. This infrastructure is now available, and customers\r\nare being moved onto the new infrastructure. The rollout of the new probing\r\n",
    "pubDate": "2025-10-02T16:36:44.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Build a CI/CD Pipeline for AKS Apps by Using Azure Pipelines",
    "link": "https://learn.microsoft.com/azure/architecture/guide/aks/aks-cicd-azure-pipelines",
    "description": "Learn how to build a CI/CD pipeline for AKS apps by using Azure Pipelines, with integrated testing, staging, and production deployment.",
    "pubDate": "2025-10-02T16:33:33.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Online Transaction Processing (OLTP)",
    "link": "https://learn.microsoft.com/azure/architecture/data-guide/relational-data/online-transaction-processing",
    "description": "Learn about atomicity, consistency, and other features of online transaction processing (OLTP), which manages transactional data while supporting querying.",
    "pubDate": "2025-10-02T02:14:23.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Build a Multiple-Agent Workflow Automation Solution with Semantic Kernel",
    "link": "https://learn.microsoft.com/azure/architecture/ai-ml/idea/multiple-agent-workflow-automation",
    "description": "Learn how to design scalable automation pipelines where multiple AI agents collaborate by using Semantic Kernel and Azure Container Apps for enterprise-grade tasks.",
    "pubDate": "2025-10-01T23:58:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "AI Agent Orchestration Patterns",
    "link": "https://learn.microsoft.com/azure/architecture/ai-ml/guide/ai-agent-design-patterns",
    "description": "Learn about fundamental orchestration patterns for AI agent architectures, including sequential, concurrent, group chat, handoff, and magentic patterns.",
    "pubDate": "2025-10-01T17:57:02.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Use Azure Key Vault in a Multitenant Solution",
    "link": "https://learn.microsoft.com/azure/architecture/guide/multitenant/service/key-vault",
    "description": "Learn how to use Azure Key Vault in multitenant solutions, including isolation models, tenant-specific vaults, shared vaults, and multitenancy features.",
    "pubDate": "2025-10-01T17:47:38.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[In preview] Public Preview: MSSQL extension integration with Microsoft Fabric ",
    "link": "https://azure.microsoft.com/updates?id=503646",
    "description": "The MSSQL extension for Visual Studio Code (VS Code) now brings SQL database in Fabric directly into your development workflow. With the new Fabric connectivity option in the Connection Dialog, you can sign in using Microsoft Entra ID, browse your Fabric ",
    "pubDate": "2025-10-01T17:30:57.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Azure Machine Learning - Data labeling Deprecation",
    "link": "https://azure.microsoft.com/updates?id=501692",
    "description": "On September 30, 2026, Azure Machine data labeling will be retired. Please transition to 3rd party data labeling providers by 30 September 2026.  From today to September 30, 2026, you can continue to use data labelling without disruption. On September 30,",
    "pubDate": "2025-10-01T17:30:57.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Azure Network Policy Manager (NPM) for Linux nodes on AKS to Be Retired by September 30, 2028",
    "link": "https://azure.microsoft.com/updates?id=500268",
    "description": "On September 30, 2028, we’ll end support for Azure Network Policy Manager (NPM) on Linux nodes in AKS. To avoid disruptions, migrate AKS clusters running Linux nodes from NPM to Cilium Network Policy by that date.      Transitioning to Cilium Network Poli",
    "pubDate": "2025-10-01T17:15:18.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure SQL updates for late September 2025 ",
    "link": "https://azure.microsoft.com/updates?id=503612",
    "description": "In late September 2025, the following updates and enhancements were made to Azure SQL:  Protection from ransomware attacks to long-term retention (LTR) backups via immutability. Learn more. ",
    "pubDate": "2025-10-01T16:00:52.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Meet Microsoft 365 Premium: Your AI and productivity powerhouse",
    "link": "https://www.microsoft.com/en-us/microsoft-365/blog/2025/10/01/meet-microsoft-365-premium-your-ai-and-productivity-powerhouse/",
    "description": "<p>We’re taking a big step forward with major updates to our individual subscription plans, combining the best of AI and productivity at an unbeatable price.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog/2025/10/01/meet-microsoft-365-premium-your-ai-and-productivity-powerhouse/\">Meet Microsoft 365 Premium: Your AI and productivity powerhouse</a> appeared first on <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog\">Microsoft 365 Blog</a>.</p>\n",
    "pubDate": "2025-10-01T16:00:00.000Z",
    "source": "Microsoft 365"
  },
  {
    "title": "Cybersecurity Awareness Month: Security starts with you",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/01/cybersecurity-awareness-month-security-starts-with-you/",
    "description": "<p>At Microsoft, we believe that cybersecurity is as much about people as it is about technology. Explore some of our resources for Cybersecurity Awareness Month to stay safe online. </p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/01/cybersecurity-awareness-month-security-starts-with-you/\">Cybersecurity Awareness Month: Security starts with you</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-01T16:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "Introducing Microsoft Agent Framework",
    "link": "https://azure.microsoft.com/en-us/blog/introducing-microsoft-agent-framework/",
    "description": "<p>Microsoft Agent Framework, now in public preview, and new capabilities in Azure AI Foundry make it easier for developers to build, observe, and govern multi-agent systems.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/introducing-microsoft-agent-framework/\">Introducing Microsoft Agent Framework</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-01T14:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Use Azure Red Hat OpenShift in the Financial Services Industry",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aro/azure-redhat-openshift-financial-services-workloads",
    "description": "Learn how to use an Azure Red Hat OpenShift landing zone to create secure, resilient, and compliant solutions in a hybrid cloud environment.",
    "pubDate": "2025-09-30T20:31:35.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[In preview] Public Preview: Soft Delete feature in Azure Compute Gallery",
    "link": "https://azure.microsoft.com/updates?id=506886",
    "description": "The Soft Delete feature in Azure Compute Gallery lets you recover accidentally deleted images within a 7-day retention period. This grace period gives users time to restore any images that were mistakenly deleted. Learn more.",
    "pubDate": "2025-09-30T19:30:35.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Azure Virtual Desktop Landing Zone Design Guide",
    "link": "https://learn.microsoft.com/azure/architecture/landing-zones/azure-virtual-desktop/design-guide",
    "description": "Learn about the design areas in the Azure landing zone architecture for Azure Virtual Desktop, including resource organization and networking.",
    "pubDate": "2025-09-30T19:14:59.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Azure landing zones - Bicep modules design considerations",
    "link": "https://learn.microsoft.com/azure/architecture/landing-zones/bicep/landing-zone-bicep",
    "description": "Design considerations for the Azure landing zones Bicep modules.",
    "pubDate": "2025-09-30T19:14:59.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Retirement: Support for Service Connector (preview) on Azure Container Apps will end on March 30th, 2026",
    "link": "https://azure.microsoft.com/updates?id=501528",
    "description": "Support for Service Connector (preview) on Azure Container Apps will end on March 30, 2026. After this date, Service Connector (preview) will no longer be supported on Azure Container Apps. If you created service connections using the Azure Portal, your e",
    "pubDate": "2025-09-30T17:30:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: NVv4-series Azure Virtual Machines will be retired on September 30, 2026",
    "link": "https://azure.microsoft.com/updates?id=500578",
    "description": "On September 30, 2026, Microsoft Azure will retire the Standard_NV4as_v4, Standard_NV4ahs_v4,Standard_NV8as_v4, Standard_NV8ahs_v4,Standard_NV16as_v4, Standard_NV16ahs_v4, Standard_NV32as_v4, and Standard_NV32ahs_v4 virtual machines (VMs) in the NVv4-seri",
    "pubDate": "2025-09-30T17:15:32.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Spark Native Connector for Semantic Link ",
    "link": "https://azure.microsoft.com/updates?id=502602",
    "description": "Starting October 1, 2025, the Spark native connector will be officially retired. This decision is based on internal analysis indicating low usage, high maintenance costs, and potential security vulnerabilities. To ensure continued support and improved sec",
    "pubDate": "2025-09-30T13:45:49.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Big Data Architectures",
    "link": "https://learn.microsoft.com/azure/architecture/databases/guide/big-data-architectures",
    "description": "Learn how big data architectures manage the ingestion, processing, and analysis of data that's too large or complex for traditional database systems.",
    "pubDate": "2025-09-30T13:20:49.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Empowering defenders in the era of agentic AI with Microsoft Sentinel",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/09/30/empowering-defenders-in-the-era-of-agentic-ai-with-microsoft-sentinel/",
    "description": "<p>Microsoft Sentinel is expanding into an agentic platform with general availability of the Sentinel data lake, and the public preview of Sentinel graph and Sentinel Model Context Protocol (MCP) server. </p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/09/30/empowering-defenders-in-the-era-of-agentic-ai-with-microsoft-sentinel/\">Empowering defenders in the era of agentic AI with Microsoft Sentinel</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-09-30T13:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "WordPress on Azure Kubernetes Service",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/infrastructure/wordpress-container",
    "description": "Use Azure Kubernetes Service (AKS) to deploy a highly scalable and secure installation of WordPress for large, storage-intensive applications.",
    "pubDate": "2025-09-29T22:05:36.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Grok 4 is now available in Azure AI Foundry: Unlock frontier intelligence and business-ready capabilities",
    "link": "https://azure.microsoft.com/en-us/blog/grok-4-is-now-available-in-azure-ai-foundry-unlock-frontier-intelligence-and-business-ready-capabilities/",
    "description": "<p>Microsoft has collaborated closely with xAI to bring Grok 4, their most advanced model, to Azure AI Foundry—delivering powerful reasoning within a platform designed for business-ready safety and control.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/grok-4-is-now-available-in-azure-ai-foundry-unlock-frontier-intelligence-and-business-ready-capabilities/\">Grok 4 is now available in Azure AI Foundry: Unlock frontier intelligence and business-ready capabilities</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-09-29T16:15:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "[Launched] Generally Available: Visualize New Azure Resource Manager Metrics through Azure Monitor",
    "link": "https://azure.microsoft.com/updates?id=506317",
    "description": "We are announcing that Azure Resource Manager now offers enhanced integration with Azure Monitor Metrics for your subscriptions! You can now have deeper visibility and more granular monitoring capabilities for your Resource Manager operations.You can acce",
    "pubDate": "2025-09-29T15:30:44.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Vibe working: Introducing Agent Mode and Office Agent in Microsoft 365 Copilot",
    "link": "https://www.microsoft.com/en-us/microsoft-365/blog/2025/09/29/vibe-working-introducing-agent-mode-and-office-agent-in-microsoft-365-copilot/",
    "description": "<p>Today, we're bringing vibe working to Microsoft 365 Copilot with Agent Mode in Office apps and Office Agent in Copilot chat.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog/2025/09/29/vibe-working-introducing-agent-mode-and-office-agent-in-microsoft-365-copilot/\">Vibe working: Introducing Agent Mode and Office Agent in Microsoft 365 Copilot</a> appeared first on <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog\">Microsoft 365 Blog</a>.</p>\n",
    "pubDate": "2025-09-29T13:30:44.000Z",
    "source": "Microsoft 365"
  },
  {
    "title": "Azure VMware Solution AV36 Node Retirement on June 30, 2028",
    "link": "https://azure.microsoft.com/updates?id=503883",
    "description": "Microsoft is announcing the retirement of the AV36 node type\r\non June 30, 2028. The terms of your current AV36 Reserved Instance (RI) are\r\nnot affected by this announcement. At this time, we recommend that you review your current AV36\r\nRI expiration timeline",
    "pubDate": "2025-09-27T00:30:39.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Entity Linking from Azure AI Language",
    "link": "https://azure.microsoft.com/updates?id=499851",
    "description": "Microsoft\r\nis announcing the planned retirement of Entity Linking from Azure AI Language. We\r\nrecommend considering a replacement solution; Named\r\nEntity Recognition from Azure AI Language also supports entity\r\nidentification. Microsoft\r\nwill provide full supp",
    "pubDate": "2025-09-26T22:00:37.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: The Linux Consumption hosting plan of Azure Functions will be retired on September 30, 2028. Migrate to Flex Consumption.",
    "link": "https://azure.microsoft.com/updates?id=499451",
    "description": "The Azure Functions Linux Consumption hosting plan is being retired. Customers are advised to migrate to the Flex Consumption plan, which offers faster scaling, advanced networking, cold start mitigation, and concurrency control. To identify affected reso",
    "pubDate": "2025-09-26T16:30:29.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Upgrade BlobFuse v1 to latest version of Blobfuse v2 ",
    "link": "https://azure.microsoft.com/updates?id=498563",
    "description": "We recommend upgrading from BlobFuse v1 to BlobFuse\r\nv2,as all future enhancements and innovations related to Azure Blob Storage file system access will be focused exclusively on BlobFuse v2. Please note that support for BlobFuse v1 will be discontinued ef",
    "pubDate": "2025-09-26T16:00:55.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Build and Deploy Custom Document Processing Models on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/ai-ml/architecture/build-deploy-custom-models",
    "description": "Learn more about Azure options for orchestrating, storing, building, deploying, and using custom document processing models.",
    "pubDate": "2025-09-26T15:30:28.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Retirement: Azure App Service on Azure Arc enabled Kubernetes",
    "link": "https://azure.microsoft.com/updates?id=500016",
    "description": "Beginning on September 30th 2025, Azure App Service on Azure Arc enabled Kubernetes will be retired, and customers will no longer be able to install the extension.To continue to host your application workloads, we request you migrate to other solutions su",
    "pubDate": "2025-09-26T11:45:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Design Principles for Azure Applications",
    "link": "https://learn.microsoft.com/azure/architecture/guide/design-principles",
    "description": "Learn key design principles for Azure applications, including self-healing, redundancy, scaling, partitioning, and using managed services effectively.",
    "pubDate": "2025-09-25T19:17:12.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Design a Microservices Architecture",
    "link": "https://learn.microsoft.com/azure/architecture/microservices/design",
    "description": "Learn how to design and build a microservices architecture on Azure by following a reference implementation that illustrates best practices.",
    "pubDate": "2025-09-25T19:15:10.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[Launched] Generally Available: Azure NetApp Files Flexible service level",
    "link": "https://azure.microsoft.com/updates?id=503687",
    "description": "Flexible service level allows you to independently configure storage capacity and throughput, optimizing costs and performance by right-sizing based on your needs. This new service level avoids overprovisioning by supporting a customizable throughput whic",
    "pubDate": "2025-09-25T17:00:08.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Introducing Microsoft Marketplace — Thousands of solutions. Millions of customers. One Marketplace.",
    "link": "https://blogs.microsoft.com/blog/2025/09/25/introducing-microsoft-marketplace-thousands-of-solutions-millions-of-customers-one-marketplace/",
    "description": "<p>A new breed of industry-leading company is taking shape — Frontier Firms. These organizations blend human ambition with AI-powered technology to reshape how innovation is scaled, work is orchestrated and value is created. They’re accelerating AI transformation to enrich employee experiences, reinvent customer engagement, reshape business processes and unlock creativity and innovation.</p>\n<p>The post <a href=\"https://blogs.microsoft.com/blog/2025/09/25/introducing-microsoft-marketplace-thousands-of-solutions-millions-of-customers-one-marketplace/\">Introducing Microsoft Marketplace — Thousands of solutions. Millions of customers. One Marketplace.</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-09-25T16:03:19.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Introducing Microsoft Marketplace — Thousands of solutions. Millions of customers. One Marketplace.",
    "link": "https://blogs.microsoft.com/blog/2025/09/25/introducing-microsoft-marketplace-thousands-of-solutions-millions-of-customers-one-marketplace/",
    "description": "<p>To empower customers in becoming Frontier, we’re excited to announce the launch of the reimagined Microsoft Marketplace, your trusted source for cloud solutions, AI apps and agents.</p>\n<p>The post <a href=\"https://blogs.microsoft.com/blog/2025/09/25/introducing-microsoft-marketplace-thousands-of-solutions-millions-of-customers-one-marketplace/\">Introducing Microsoft Marketplace — Thousands of solutions. Millions of customers. One Marketplace.</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-09-25T15:47:32.000Z",
    "source": "Security"
  },
  {
    "title": "Empower your workforce with agents in Microsoft 365 Copilot",
    "link": "https://www.microsoft.com/en-us/microsoft-cloud/blog/2025/09/25/empower-your-workforce-with-agents-in-microsoft-365-copilot/",
    "description": "<p>We're announcing the launch of the Microsoft Marketplace, a unified web destination to find, try, and buy our full catalog of cloud solutions, AI apps, and agents.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/microsoft-cloud/blog/2025/09/25/empower-your-workforce-with-agents-in-microsoft-365-copilot/\">Empower your workforce with agents in Microsoft 365 Copilot</a> appeared first on <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog\">Microsoft 365 Blog</a>.</p>\n",
    "pubDate": "2025-09-25T14:00:00.000Z",
    "source": "Microsoft 365"
  },
  {
    "title": "Retirement: The Insights blade in AKS is now called Monitor",
    "link": "https://azure.microsoft.com/updates?id=497368",
    "description": "The Insights blade in AKS has been renamed to Monitor and relocated\r\nfrom the Monitoring section to the top level of the table of contents for\r\nincreased visibility. You’ll continue to have access to the same monitoring\r\ndata and features—there are no change",
    "pubDate": "2025-09-25T12:00:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Discover and assess PostgreSQL in Azure Migrate ",
    "link": "https://azure.microsoft.com/updates?id=503641",
    "description": "Planning the next move for your PostgreSQL workloads just got easier. Azure Migrate now enables you to discover and assess PostgreSQL resources across VMware, Hyper‑V, physical servers, and other cloud environments. Azure Migrate provides a centralized hu",
    "pubDate": "2025-09-24T17:00:24.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Delete on-demand backup in Azure DB for MySQL - Flexible Server ",
    "link": "https://azure.microsoft.com/updates?id=503622",
    "description": "You can now manually trigger on-demand backups in Azure DB for MySQL - Flexible Server instead of solely relying on the system-initiated automated backups and schedule. As part of August 2025 release, you can delete on-demand backups that are no longer ne",
    "pubDate": "2025-09-24T17:00:24.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Agent Factory: Designing the open agentic web stack",
    "link": "https://azure.microsoft.com/en-us/blog/agent-factory-designing-the-open-agentic-web-stack/",
    "description": "<p>Unlock enterprise value with an open, secure, and interoperable AI agent ecosystem.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/agent-factory-designing-the-open-agentic-web-stack/\">Agent Factory: Designing the open agentic web stack</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-09-24T15:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Expanding model choice in Microsoft 365 Copilot",
    "link": "https://www.microsoft.com/en-us/microsoft-365/blog/2025/09/24/expanding-model-choice-in-microsoft-365-copilot/",
    "description": "<p>We’re excited to announce that we’re expanding the models that power Microsoft 365 Copilot with the addition of Anthropic models.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog/2025/09/24/expanding-model-choice-in-microsoft-365-copilot/\">Expanding model choice in Microsoft 365 Copilot</a> appeared first on <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog\">Microsoft 365 Blog</a>.</p>\n",
    "pubDate": "2025-09-24T15:00:00.000Z",
    "source": "Microsoft 365"
  },
  {
    "title": "Retirement: Azure Disk Encryption",
    "link": "https://azure.microsoft.com/updates?id=493779",
    "description": "Azure\r\nDisk Encryption will be retired on September 15, 2028 and we recommend you transition to Encryption\r\nat Host by that date.   Alternate disk encryption solutions such as\r\nEncryption At Host and CVM OS disk encryption offer broader operating system\r\nsupp",
    "pubDate": "2025-09-24T11:45:14.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Site Recovery Support for Virtual Machines with Premium SSD v2 disks",
    "link": "https://azure.microsoft.com/updates?id=502998",
    "description": "Announcing the General Availability of Azure Site Recovery (ASR) for Virtual Machines with Premium SSD v2 disks. ASR provides seamless disaster recovery for Virtual Machines across Azure Regions and from on-premises to Azure, helping organizations maintai",
    "pubDate": "2025-09-23T17:30:13.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Use Delphix for Data Masking in Azure Data Factory and Azure Synapse Analytics",
    "link": "https://learn.microsoft.com/azure/architecture/databases/guide/data-obfuscation-with-delphix-in-azure-data-factory",
    "description": "Learn how to use Delphix with Azure Data Factory and Azure Synapse Analytics to automate data masking, ensure compliance, and streamline secure data workflows.",
    "pubDate": "2025-09-23T16:42:51.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Scramble SAP Data by using Delphix and Azure Data Factory or Azure Synapse Analytics",
    "link": "https://learn.microsoft.com/azure/architecture/databases/guide/data-scrambling-for-sap-using-delphix-and-azure-data-factory",
    "description": "Learn about how to perform data scrambling for SAP applications by using Delphix and Azure Data Factory or Azure Synapse Analytics.",
    "pubDate": "2025-09-23T16:42:51.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Retirement: NVv3-series Azure Virtual Machines will be retired on September 30 ,2026",
    "link": "https://azure.microsoft.com/updates?id=500573",
    "description": "On September 30, 2026, Microsoft Azure will retire the Standard_NV12s_v3, Standard_NV12hs_v3, Standard_NV24s_v3, Standard_NV24ms_v3, Standard_NV32ms_v3, and Standard_NV48s_v3 virtual machines (VMs) in the NVv3-series virtual machines (VMs). To avoid any d",
    "pubDate": "2025-09-23T16:00:30.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: GitHub Copilot app modernization capabilities for Java and .NET are now available",
    "link": "https://azure.microsoft.com/updates?id=503603",
    "description": "App modernization is essential for enterprises to stay\r\nsecure, scalable and innovative—but traditionally it requires a lot of effort\r\nthat can be redundant and complex. With GitHub Copilot app modernization,\r\ndevelopers can now stay focused on innovation wh",
    "pubDate": "2025-09-23T15:00:40.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "How Azure Cobalt 100 VMs are powering real-world solutions, delivering performance and efficiency results",
    "link": "https://azure.microsoft.com/en-us/blog/how-azure-cobalt-100-vms-are-powering-real-world-solutions-delivering-performance-and-efficiency-results/",
    "description": "<p>Cobalt 100 systems are designed to deliver high performance, energy efficiency, and cost effectiveness for a wide range of workloads.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/how-azure-cobalt-100-vms-are-powering-real-world-solutions-delivering-performance-and-efficiency-results/\">How Azure Cobalt 100 VMs are powering real-world solutions, delivering performance and efficiency results</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-09-23T15:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Accelerate migration and modernization with agentic AI",
    "link": "https://azure.microsoft.com/en-us/blog/accelerate-migration-and-modernization-with-agentic-ai/",
    "description": "<p>At the Migrate and Modernize Summit, we’re announcing a comprehensive set of agentic AI solutions and offerings to accelerate transformation and reduce friction.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/accelerate-migration-and-modernization-with-agentic-ai/\">Accelerate migration and modernization with agentic AI</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-09-23T13:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Understand Data Models",
    "link": "https://learn.microsoft.com/azure/architecture/data-guide/technology-choices/understand-data-store-models",
    "description": "Learn how to evaluate Azure data store models based on workload patterns, scale, consistency, and governance to guide service selection.",
    "pubDate": "2025-09-22T17:58:53.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Prepare to Choose a Data Store in Azure",
    "link": "https://learn.microsoft.com/azure/architecture/guide/technology-choices/data-stores-getting-started",
    "description": "Learn how to choose the right Azure data store for your workloads by evaluating functional, performance, cost, and security requirements.",
    "pubDate": "2025-09-22T17:58:53.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Application design considerations for mission-critical workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-app-design",
    "description": "Learn how to implement a mission-critical workload that users access over a public endpoint without extra dependencies to other company resources.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Application platform considerations for mission-critical workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-app-platform",
    "description": "Reference architecture for a workload that is accessed over a public endpoint without additional dependencies to other company resources - App Platform.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Data platform for mission-critical workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-data-platform",
    "description": "Data decisions for the architecture of a mission-critical workload on Azure.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Deployment and testing for mission-critical workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-deploy-test",
    "description": "Reference architecture for a workload that is accessed over a public endpoint without extra dependencies to other company resources - Deployment and Testing.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Health modeling for mission-critical workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-health-modeling",
    "description": "Reference architecture for a workload that is accessed over a public endpoint without extra dependencies to other company resources - Health modeling.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Mission-critical architecture on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-intro",
    "description": "Architecture design for a highly reliable workload.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Networking and connectivity for mission-critical workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-networking",
    "description": "Networking decisions for the architecture of a mission-critical workload on Azure.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Operations for mission-critical workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-operations",
    "description": "Guidance for operations for the architecture of a mission-critical workload on Azure.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Security Considerations for Mission-Critical Workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-security",
    "description": "Learn about the security considerations for a workload that's accessed over a public endpoint without dependencies on other company resources.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[Launched] Generally Available: Using Server-sent events with Application Gateway",
    "link": "https://azure.microsoft.com/updates?id=503909",
    "description": "Azure Application Gateway supports use of Server-sent events in general\r\navailability, enabling real-time data streaming from server to client.\r\nServer-sent events utilize server push technology on a persistent HTTP\r\nconnection for seamless updates to the cl",
    "pubDate": "2025-09-22T17:00:22.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Use Azure Synapse Analytics for Near Real-Time Lakehouse Data Processing",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/data/real-time-lakehouse-data-processing",
    "description": "Use Azure Event Hubs, Azure Synapse Analytics, and Azure Data Lake Storage to create an end-to-end, near real-time data lakehouse data processing solution.",
    "pubDate": "2025-09-22T16:28:15.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[Launched] Generally Available: Vaulted backup for Azure Files (Premium)",
    "link": "https://azure.microsoft.com/updates?id=503806",
    "description": "Announcing the General availability of vaulted backup for Azure Files shares premium!  Azure Backup brings vaulted protection to Azure Files shares premium, to ensure business\r\ncontinuity and compliance, even in the face of accidental deletion, malicious\r\na",
    "pubDate": "2025-09-22T16:15:14.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Extract text from objects using Power Automate and AI Builder",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/ai/extract-object-text",
    "description": "Use AI Builder and Azure AI Document Intelligence in a Power Automate workflow to extract text from images, for indexing and retrieval.",
    "pubDate": "2025-09-19T20:28:14.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "IBM z/OS mainframe migration with Avanade AMT",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/avanade-amt-zos-migration",
    "description": "See how to use the Avanade Automated Migration Technology (AMT) framework to migrate IBM z/OS mainframe workloads to Azure.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Refactor mainframe architecture by using CloudFrame Renovate",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/cloudframe-renovate-mainframe-refactor",
    "description": "Refactor your mainframe architecture to Azure by using the CloudFrame Renovate code migration tool. Renovate migrates COBOL to Java.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Extend mainframe applications to Azure by using Verastream Host Integrator",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/extend-mainframe-applications",
    "description": "Extend your mainframe applications to Azure by using the Verastream Host Integrator (VHI). VHI simplifies mainframe and host-based application functionality into a web service.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Mainframe file and tape backup to Azure using Luminex",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/luminex-mainframe-file-tape-transfer",
    "description": "Use Luminex products to transfer mainframe file and tape data to and from Azure to meet backup, archival, and other business needs.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  }
]