[
  {
    "title": "Active - Azure Databricks connection failures in West US 3",
    "link": "https://status.azure.com/en-us/status/",
    "description": "<p>We are investigating an alert for Azure Databricks service in West US 3. We will provide more information as it becomes available.</p>",
    "pubDate": "2025-11-26T23:09:00.000Z",
    "source": "Azure Status"
  },
  {
    "title": "Charting the future of SOC: Human and AI collaboration for better security",
    "link": "https://techcommunity.microsoft.com/blog/microsoftsecurityexperts/charting-the-future-of-soc-human-and-ai-collaboration-for-better-security/4470688",
    "description": "<p>This blog shares our journey and insights from building autonomous AI agents for MDR operations and explores how the shift to a GenAI-powered SOC redefines collaboration between humans and AI.</p>\n<p>The post <a href=\"https://techcommunity.microsoft.com/blog/microsoftsecurityexperts/charting-the-future-of-soc-human-and-ai-collaboration-for-better-security/4470688\">Charting the future of SOC: Human and AI collaboration for better security</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-11-25T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[In preview] Public Preview: Managed Identity support in Network Watcher VNET flow log, traffic analytics and packet capture",
    "link": "https://azure.microsoft.com/updates?id=534482",
    "description": "VNET flow log captures IP\r\ntraffic flowing through VNETs, subnets, and NICs for monitoring, troubleshooting,\r\nnetwork optimization, security, and compliance needs and stores the logs in Azure\r\nStorage Traffic Analytics leverages\r\nVNET flow logs and aggregates",
    "pubDate": "2025-11-25T16:45:50.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Claude Opus 4.5 Available in Microsoft Foundry",
    "link": "https://azure.microsoft.com/updates?id=534541",
    "description": "Claude Opus 4.5 is now available in public preview on\r\nMicrosoft Foundry, bringing advanced coding, agentic workflows, and enterprise\r\nproductivity to Azure customers. Claude Opus 4.5 sets a new benchmark for performance\r\nand versatility, outperforming previ",
    "pubDate": "2025-11-24T20:30:10.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure File Sync in New Zealand North",
    "link": "https://azure.microsoft.com/updates?id=533437",
    "description": "Azure File Sync enables seamless tiering of data from on-premises Windows Servers to Azure Files for hybrid use cases and simplified migration. It also enables you to leverage the performance, flexibility and compatibility of your on-premises File Server ",
    "pubDate": "2025-11-24T18:00:42.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Entra ID support for RDP connections ",
    "link": "https://azure.microsoft.com/updates?id=526018",
    "description": "Announcing Azure Bastion now supports Microsoft Entra ID\r\nauthentication for RDP connections to Windows VMs directly in the portal. This update\r\nbrings two key benefits for RDP users connecting to their virtual machines: Enhanced Security: By eliminating lo",
    "pubDate": "2025-11-24T17:15:03.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Load Testing in Italy North",
    "link": "https://azure.microsoft.com/updates?id=532481",
    "description": "Azure Load Testing capability in Azure App Testing is now generally available in Italy North. Customers can now use Azure Load Testing, a fully managed load-testing service to generate high scale load and run simulations, easily identify performance bottl",
    "pubDate": "2025-11-24T17:00:10.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Regex support in T-SQL ",
    "link": "https://azure.microsoft.com/updates?id=532207",
    "description": "Boost your SQL queries with powerful regular expressions (regex) support for advanced pattern matching. Now you can use native regex in T-SQL directly in Azure SQL and SQL Server 2025 queries—simplifying code, improving maintainability, and reducing depen",
    "pubDate": "2025-11-24T17:00:10.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure MCP Server for Azure Database for MySQL ",
    "link": "https://azure.microsoft.com/updates?id=532197",
    "description": "Announcing that Azure MCP Server now supports Azure Database for MySQL. With this update, you can empower AI agents and applications to interact with your MySQL data using natural language through the open Model Context Protocol (MCP). Instead of writing ",
    "pubDate": "2025-11-24T17:00:10.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Custom handler support in Azure Functions Flex consumption ",
    "link": "https://azure.microsoft.com/updates?id=512413",
    "description": "Azure Functions now supports custom\r\nhandlers in Flex consumption. Custom handlers are lightweight web servers that\r\nreceive events from the Functions host. Any language that supports HTTP\r\nprimitives can implement a custom handler.  Custom handlers are best",
    "pubDate": "2025-11-21T19:15:38.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Migrate to dedicated VM for your compute clusters",
    "link": "https://azure.microsoft.com/updates?id=501658",
    "description": "On September 30, 2025, Low-Priority VM will reach end of life. However, you will continue to be supported on Azure Machine Learning until March 31, 2026.  To ensure that your clusters are not automatically scaled down it is recommended to migrate to dedic",
    "pubDate": "2025-11-21T18:45:18.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Microsoft named a Leader in the Gartner® Magic Quadrant™ for Access Management for the ninth consecutive year",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/11/21/microsoft-named-a-leader-in-the-gartner-magic-quadrant-for-access-management-for-the-ninth-consecutive-year/",
    "description": "<p>We’re happy to share that Microsoft has been recognized as a Leader in the 2025 Gartner® Magic Quadrant™ for Access Management for the ninth consecutive year.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/11/21/microsoft-named-a-leader-in-the-gartner-magic-quadrant-for-access-management-for-the-ninth-consecutive-year/\">Microsoft named a Leader in the Gartner® Magic Quadrant™ for Access Management for the ninth consecutive year</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-11-21T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[In preview] Public Preview: Container network metrics filtering in Advanced Container Networking Services for (ACNS) for AKS ",
    "link": "https://azure.microsoft.com/updates?id=523076",
    "description": "Container network metrics\r\nfiltering in Azure Container Networking Services (ACNS) is now available in\r\npublic preview. In\r\ncontainerized environments, the ingestion of excessive network metrics can lead\r\nto inflated storage costs and cluttered dashboards, ma",
    "pubDate": "2025-11-20T20:00:10.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: MCP support for AI toolchain operator add-on in AKS",
    "link": "https://azure.microsoft.com/updates?id=523152",
    "description": "MCP support for AI toolchain operator add-on is\r\nnow Generally Available.    The AI Toolchain Operator add-on now supports\r\nKAITO inference workspaces with integrated tool calling and Model Context\r\nProtocol (MCP), addressing key challenges around dynamic mo",
    "pubDate": "2025-11-20T18:45:04.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Cluster-wide Cilium network policy with Azure CNI powered by Cilium for AKS ",
    "link": "https://azure.microsoft.com/updates?id=523120",
    "description": "Cluster-wide Cilium network\r\npolicy for AKS clusters using Azure CNI powered by Cilium is now Generally\r\nAvailable.   Managing consistent network policies across Kubernetes\r\nnamespaces has long been a challenge for platform teams, especially in\r\nmulti-tenant ",
    "pubDate": "2025-11-20T18:30:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Local redirect policy in Azure CNI powered by Cilium for AKS ",
    "link": "https://azure.microsoft.com/updates?id=523081",
    "description": "Local redirect policy with Azure\r\nCNI powered by Cilium for AKS is now generally available. Customers running high-scale AKS workloads often experience\r\nlatency and performance bottlenecks due to cross-node traffic routing. The new local\r\nredirect policy add",
    "pubDate": "2025-11-20T18:30:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Layer 7 policy with Advanced Container Networking Services (ACNS) for AKS",
    "link": "https://azure.microsoft.com/updates?id=523115",
    "description": "To address the growing need for granular traffic control in\r\nmicroservices architectures, Azure Container Networking Services now offers\r\nLayer 7 Policy as a generally available feature. This capability empowers\r\ncustomers to enforce fine-grained traffic con",
    "pubDate": "2025-11-20T18:15:25.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure NetApp Files single file restore from backup ",
    "link": "https://azure.microsoft.com/updates?id=522077",
    "description": "With Azure NetApp Files single file restore from backup, you can restore individual files from Azure NetApp Files backup vault without needing to restore an entire volume. By restoring only the necessary files, you can save time and cost needed for restor",
    "pubDate": "2025-11-20T18:15:25.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: DNS security policy Threat Intelligence feed",
    "link": "https://azure.microsoft.com/updates?id=530183",
    "description": "Azure\r\nDNS security policy Threat Intelligence feed is now generally available.\r\nProtect against known malicious domains with Microsoft’s managed Threat\r\nIntelligent feed.  Smart Protection  \r\n Almost all attacks begin with\r\n     a DNS query. Threat Intelligen",
    "pubDate": "2025-11-20T17:00:13.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Sphere OS version 25.10 is now available",
    "link": "https://azure.microsoft.com/updates?id=522390",
    "description": "Azure Sphere OS version 25.10 is now available in the Retail feed. This release includes updates to Azure Sphere OS only; it does not include an updated SDK. If your devices are connected to the internet, they will receive the updated OS from the cloud.Th",
    "pubDate": "2025-11-20T16:00:12.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Trusted Launch is now supported for Arm64 Marketplace Images ",
    "link": "https://azure.microsoft.com/updates?id=529797",
    "description": "Announcing that\r\nTrusted Launch supported Arm64 Images are now available in the Azure\r\nMarketplace. You can now get the dual benefit of cost and performance efficiencies\r\nof Arm64 in addition to the security benefits of Trusted Launch.  Arm64 VMs bring cost\r\n",
    "pubDate": "2025-11-20T15:00:59.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure NetApp Files migration assistant (portal support) ",
    "link": "https://azure.microsoft.com/updates?id=525620",
    "description": "Azure NetApp Files migration assistant (with SnapMirror) provides efficient and cost-effective data migration leveraging ONTAP's built-in replication engine for seamless transition from on-premises or CVO/other cloud providers to Azure NetApp Files (ANF).",
    "pubDate": "2025-11-20T13:45:47.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure NetApp Files cache volumes    ",
    "link": "https://azure.microsoft.com/updates?id=523917",
    "description": "Azure NetApp Files cache volumes are now available in public preview. The cache volumes feature is a new capability built on NetApp’s ONTAP FlexCache technology that provides a persistent, high-performance cache in Azure for data stored on ONTAP-based sto",
    "pubDate": "2025-11-20T13:45:47.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Monitor for Azure Arc-enabled Kubernetes with OpenShift and Azure Red Hat OpenShift",
    "link": "https://azure.microsoft.com/updates?id=530174",
    "description": "Azure Monitor provides a complete set of services for monitoring the health and performance of different layers of your Kubernetes infrastructure and the applications that depend on it.Azure Monitor now supports Azure Arc-enabled Kubernetes with OpenShift",
    "pubDate": "2025-11-20T08:00:32.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Managed Lustre Support for Azure MCP Server",
    "link": "https://azure.microsoft.com/updates?id=529381",
    "description": "Azure Managed Lustre now offers full integration with Azure MCP Server, and this capability is generally available. Azure MCP Server enables developers and infrastructure teams to manage Azure resources—including Azure Managed Lustre file systems—using na",
    "pubDate": "2025-11-19T21:00:38.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: CSI Dynamic Provisioning for Azure Managed Lustre",
    "link": "https://azure.microsoft.com/updates?id=529368",
    "description": "CSI Dynamic Provisioning for Azure Managed Lustre (AMLFS) is now generally available. With dynamic provisioning, Kubernetes applications can request AMLFS-backed persistent volumes on demand using standard StorageClass and PersistentVolumeClaim objects—no",
    "pubDate": "2025-11-19T21:00:38.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: 20 MB/s/TiB Performance Tier for Azure Managed Lustre ",
    "link": "https://azure.microsoft.com/updates?id=529359",
    "description": "Azure Managed Lustre now offers a new 20 MB/s/TiB performance tier in public preview, designed to meet the demands of large-scale AI and high-performance computing (HPC) workloads. This tier enables customers to provision file systems up to 25 PiB in a si",
    "pubDate": "2025-11-19T21:00:38.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Auto-import for Azure Managed Lustre",
    "link": "https://azure.microsoft.com/updates?id=529342",
    "description": "The Auto-import feature for Azure Managed Lustre (AMLFS) is now available in public preview. Auto-import enables seamless, policy-driven synchronization of data from Azure Blob Storage containers into AMLFS clusters, automatically reflecting new, changed,",
    "pubDate": "2025-11-19T20:00:49.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Recommended alerts for Azure Monitor Workspace",
    "link": "https://azure.microsoft.com/updates?id=515505",
    "description": "Azure Monitor now offers one-click enablement of recommended alerts directly in the Azure Portal for Azure Monitor Managed service for Prometheus customers. These alerts enable you to monitor the ingestion limits for Azure Monitor Workspace and avoid metr",
    "pubDate": "2025-11-19T17:45:05.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Managed Redis integration with Microsoft Foundry",
    "link": "https://azure.microsoft.com/updates?id=532188",
    "description": "Azure Managed Redis is now available as part of the Microsoft Foundry MCP tools catalog, allowing customers to use Redis as a knowledge store or memory store for AI agents. This integration makes it simple to connect Redis to Foundry-based agents, enablin",
    "pubDate": "2025-11-19T17:30:18.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: TLS and TCP termination on Azure Application Gateway",
    "link": "https://azure.microsoft.com/updates?id=532202",
    "description": "Azure Application Gateway has introduced general availability support\r\nfor TLS and TCP protocol termination. This enhancement enables you to load\r\nbalance and securely process non-HTTP(S) traffic for applications that rely on\r\nTCP or TLS protocols. The gatew",
    "pubDate": "2025-11-19T17:00:30.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Microsoft Foundry data connection for Azure Databricks",
    "link": "https://azure.microsoft.com/updates?id=527678",
    "description": "Azure Databricks Genie is now integrated with Microsoft Foundry and in public preview. You can now connect Genie spaces directly to Microsoft Foundry agents using Model Context Protocol (MCP), giving you seamless access to trusted data for building intell",
    "pubDate": "2025-11-19T17:00:30.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Databricks Genie in Copilot Studio ",
    "link": "https://azure.microsoft.com/updates?id=527668",
    "description": "Azure Databricks Genie is now available in Microsoft Copilot Studio, giving you direct access to intelligent, enterprise-grade AI answers across your full Azure Databricks data estate. This integration unlocks enterprise-grade, conversational analytics ac",
    "pubDate": "2025-11-19T17:00:30.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure API Management adds support for A2A Agent APIs",
    "link": "https://azure.microsoft.com/updates?id=527635",
    "description": "Announcing the public preview of A2A API support in Azure API Management.\r\nWith this new capability, organizations can manage and govern agent APIs\r\nalongside other API types — AI model APIs, Model Context Protocol (MCP) tools,\r\nand traditional APIs such as ",
    "pubDate": "2025-11-19T17:00:30.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Claude in Microsoft Foundry",
    "link": "https://azure.microsoft.com/updates?id=532303",
    "description": "Claude models by Anthropic are now\r\navailable for Public Preview in Microsoft Foundry, expanding the platform’s unified ecosystem of\r\nfrontier AI. Enterprises can access Claude Sonnet 4.5, Opus 4.1, and Haiku 4.5\r\nfor advanced long-context reasoning, coding,",
    "pubDate": "2025-11-19T00:00:31.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Copilot agents - a closer look at the deployment agent ",
    "link": "https://azure.microsoft.com/updates?id=526751",
    "description": "Following our Azure Copilot announcement introducing agentic\r\ncapabilities, this update focuses on one of the six new agents: the deployment\r\nagent. The deployment agent helps you discover, plan, and deploy cloud\r\nworkloads faster and with confidence using n",
    "pubDate": "2025-11-18T20:15:19.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In development] Private Preview: Azure HorizonDB ",
    "link": "https://azure.microsoft.com/updates?id=529806",
    "description": "Engineered for performance, Azure HorizonDB for PostgreSQL delivers future-proof, autoscaling storage up to 128 TB, up to 3 times faster performance than open-source PostgreSQL, and rapid compute scalability to 3,072 vCores. Now in private preview, Azure ",
    "pubDate": "2025-11-18T18:00:28.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Private Marketplace for VS Code",
    "link": "https://azure.microsoft.com/updates?id=526909",
    "description": "The VS Code Private Marketplace is a secure, enterprise-ready way to host and manage extensions internally—fully integrated with VS Code. Teams can self-host, deploy easily, and manage updates with flexibility and control.Learn more.",
    "pubDate": "2025-11-18T18:00:28.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Microsoft Defender for Cloud + GitHub Advanced Security ",
    "link": "https://azure.microsoft.com/updates?id=526876",
    "description": "With Microsoft Defender for Cloud and GitHub Advanced\r\nSecurity, protect cloud-native applications across the full app lifecycle from\r\ncode to cloud. This natively integrated solution helps unify developers and\r\nsecurity teams in one workflow while staying i",
    "pubDate": "2025-11-18T18:00:28.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Smart Tier account level tiering (Azure Blob Storage and ADLS)",
    "link": "https://azure.microsoft.com/updates?id=526188",
    "description": "Introducing smart tier Public Preview for account level\r\ntiering Announcing the public preview of smart\r\ntier for Azure Blob Storage and Azure Data Lake Storage (ADLS). Smart tier\r\nis a fully managed and automated data tiering solution, avoiding manual tier\r\n",
    "pubDate": "2025-11-18T18:00:28.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Managed Instance on Azure App Service",
    "link": "https://azure.microsoft.com/updates?id=523623",
    "description": "Announcing Managed Instance on Azure App Service, now in Public Preview! This new capability makes it easy to move web apps to the cloud with minimal configuration—no code rewrites required. Whether your .NET apps run on-premises or in VMs, you can move t",
    "pubDate": "2025-11-18T18:00:28.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Entra-only identities support with Azure Files SMB ",
    "link": "https://azure.microsoft.com/updates?id=527713",
    "description": "Azure Files now supports Entra-only identities, enabling customers to retire on-premises domain controllers while maintaining secure SMB access to file shares. This feature delivers a fully cloud-native authentication model using Microsoft Entra Kerberos ",
    "pubDate": "2025-11-18T17:30:44.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In development] Private Preview: Azure Boost confidential device",
    "link": "https://azure.microsoft.com/updates?id=530661",
    "description": "The\r\nAzure Boost confidential device feature is now in preview. Azure Boost\r\nis a Microsoft Azure system that offloads virtualization tasks—such as\r\nnetworking, storage, and host management—from the hypervisor and host OS to\r\npurpose-built hardware and softwa",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Microsoft HTTP DDoS Ruleset 1.0 on Application Gateway WAF v2",
    "link": "https://azure.microsoft.com/updates?id=530609",
    "description": "Announcing the public preview\r\nof the HTTP DDoS Ruleset for Application Gateway WAF v2. HTTP-layer DDoS attacks remain a leading cause of\r\napplication downtime, and traditional static controls often fall short against\r\nevolving botnets. The new HTTP DDoS Rul",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In development] Private Preview: Azure Boost remote storage throughput and network bandwidth enhancements",
    "link": "https://azure.microsoft.com/updates?id=530287",
    "description": "Remote storage throughput and network bandwidth performance\r\nenhancements for the latest Azure Boost architecture are now in preview. Azure\r\nBoost is a Microsoft Azure system that offloads virtualization tasks—such as\r\nnetworking, storage, and host managemen",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: NCv6 Virtual Machines",
    "link": "https://azure.microsoft.com/updates?id=530208",
    "description": "We are announcing the public preview of NCv6 RTX PRO 6000 Blackwell\r\nServer Edition Virtual Machines, as the next enhancement of NC Series VMs\r\navailable on Azure.\r\nNvidia RTX PRO 6000 BSE GPUs are designed to accelerate a wide array of\r\nworkloads including v",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: New integration and extensibility capabilities to Azure SRE Agent",
    "link": "https://azure.microsoft.com/updates?id=529944",
    "description": "Azure SRE Agent is an AI-driven solution that unifies operational workflows into a single, prompt-based automation layer—eliminating complexity and reducing overhead for modern cloud operations. Unlike traditional, static automation solutions, SRE Agent l",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Advanced sampling and richer data collection in Azure Monitor OpenTelemetry Distro",
    "link": "https://azure.microsoft.com/updates?id=529519",
    "description": "Azure continues to embrace open standards by adding new capabilities to the Azure Monitor OpenTelemetry Distro that powers Azure Monitor Application Insights. New Capabilities:Rate-limited sampling and\r\ntrace-based log sampling:  New sampling options in\r\nth",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Network Watcher – Agentless Connection Troubleshoot ",
    "link": "https://azure.microsoft.com/updates?id=527815",
    "description": "Agentless Connection Troubleshoot (public preview)\r\nintroduces a faster, simpler, and fully agentless way to diagnose network\r\nconnectivity issues across Azure resources. Previously, running connectivity\r\nchecks required installing the Network Watcher Extens",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Network Watcher Topology – AKS Visualization",
    "link": "https://azure.microsoft.com/updates?id=527810",
    "description": "Azure Kubernetes Service (AKS) visualization in\r\nNetwork Watcher Topology (Public Preview) delivers end-to-end visibility of AKS\r\nclusters directly within the Azure networking experience. Customers can now\r\nexplore their Kubernetes environments, including th",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure VNet Flow Log - Filtering ",
    "link": "https://azure.microsoft.com/updates?id=527805",
    "description": "VNet Flow Log captures IP\r\ntraffic flowing through VNets, Subnets, & NICs for monitoring, troubleshooting,\r\nnetwork optimization, security, and compliance needs. This release introduces advanced filtering\r\ncapabilities in VNet Flow Logs, empowering users wit",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: ExpressRoute Scalable Gateway",
    "link": "https://azure.microsoft.com/updates?id=526729",
    "description": "ExpressRoute Scalable Gateway (ErGwScale) is our\r\nnext-generation offering that brings flexibility, performance, and operational\r\nsimplicity to Virtual Network Gateway deployments. With this release, you can\r\ndynamically scale gateway infrastructure to meet ",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Container Registry Repository Permissions with Attribute-based Access Control (ABAC)",
    "link": "https://azure.microsoft.com/updates?id=526644",
    "description": "Organizations\r\noperating Azure Container Registries (ACR) require least-privilege permissions\r\nover which Microsoft Entra identities can publish or consume container images.\r\nWith ACR repository permissions using attribute-based access control (ABAC),\r\nadmini",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Kubernetes Service desktop ",
    "link": "https://azure.microsoft.com/updates?id=526242",
    "description": "AKS desktop delivers a modern, application-centric\r\nexperience for deploying and managing workloads on Azure Kubernetes Service.\r\nBuilt on supported AKS features, best practices, and the open-source Headlamp\r\nproject, it offers a guided, self-service interfa",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Pod sandboxing on AKS ",
    "link": "https://azure.microsoft.com/updates?id=526237",
    "description": "Running\r\ncontainerized workloads in shared environments can raise concerns around\r\nsecurity and workload isolation. To address this, AKS now supports pod\r\nsandboxing, enabling customers to run containers in per-workload pod VMs. Each\r\npod VM is isolated from ",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Managed namespaces on AKS ",
    "link": "https://azure.microsoft.com/updates?id=526232",
    "description": "Managing\r\nnamespace configurations across AKS clusters has traditionally required manual\r\nsetup and ongoing maintenance, creating complexity and potential for\r\nmisconfiguration. With the general availability of Managed Namespaces, AKS now\r\nenables users to ea",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Kubernetes Fleet Manager for Arc-enabled clusters ",
    "link": "https://azure.microsoft.com/updates?id=526227",
    "description": "Managing\r\nKubernetes clusters across hybrid and multi-cloud environments can be complex\r\nand fragmented. To simplify this, Azure Kubernetes Fleet Manager now supports\r\nAzure Arc-enabled Kubernetes, enabling organizations to seamlessly manage any\r\nCNCF-complia",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Windows Server 2025 on AKS",
    "link": "https://azure.microsoft.com/updates?id=526213",
    "description": "Organizations running Windows-based\r\nworkloads on Azure Kubernetes Service (AKS) face increasing pressure to\r\nmodernize as support timelines for older Windows Server versions approach\r\nretirement. To help customers prepare, AKS now offers preview support for",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: AKS Automatic pod readiness SLA",
    "link": "https://azure.microsoft.com/updates?id=526208",
    "description": "Azure Kubernetes Service (AKS) Automatic\r\nclusters now come with a pod readiness SLA, guaranteeing that eligible pods meet\r\nreadiness criteria within five minutes at the 99.9th percentile.\r\nThis empowers customers to confidently deploy mission critical workl",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: AKS Automatic managed system node pools",
    "link": "https://azure.microsoft.com/updates?id=526203",
    "description": "Provisioning and maintaining system node pools in AKS\r\nrequires ongoing effort to ensure proper scaling, patching, and availability, tasks\r\nthat can divert resources from application development and delivery.\r\nManaged system node pools in AKS Automatic remov",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Add durability to AI agents in Azure Functions using Microsoft Agent Framework",
    "link": "https://azure.microsoft.com/updates?id=526179",
    "description": "You can now build and host reliable\r\nproduction-grade AI agents using the durable extension for\r\nMicrosoft Agent Framework. This integration combines the Microsoft Agent\r\nFramework with Azure Functions’ durable capabilities, delivering proven\r\norchestration a",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Cross region pool association support for Azure Virtual Network Manager IP address management",
    "link": "https://azure.microsoft.com/updates?id=526174",
    "description": "Managing\r\nIP address spaces across multiple regions can be complex and error-prone.  With\r\nthis new capability, you can now associate a single IPAM pool with virtual\r\nnetworks in multiple regions, simplifying governance and ensuring\r\nconsistent CIDR allocatio",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Virtual Network Manager address overlap prevention in mesh ",
    "link": "https://azure.microsoft.com/updates?id=526169",
    "description": "Azure Virtual Network Manager\r\naddress space overlap prevention in mesh is now generally available, bringing enhanced\r\nreliability and governance to multi-virtual network environments. Unintended\r\naddress overlap within mesh can lead to dropped traffic. This",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Functions support for Node.js 24 ",
    "link": "https://azure.microsoft.com/updates?id=526077",
    "description": "You can now develop functions using Node.js 24 locally and deploy them\r\nto Azure Functions on Windows and Linux.   Note: Node.js 24 does not support\r\n32-bit systems on Windows. To ensure compatibility, new Windows Function Apps for\r\nNode.js 24 now default to",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Functions support for Java 25 ",
    "link": "https://azure.microsoft.com/updates?id=526072",
    "description": "You can now develop functions using Java\r\n25 locally and deploy them to Azure Functions on Windows and Linux.  Upgrade your apps to Java 25 to take\r\nadvantage of enhanced security, a longer support window, and continued\r\ncompatibility with the Azure Function",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Application Gateway for Containers – Slow start",
    "link": "https://azure.microsoft.com/updates?id=525893",
    "description": "Slow start is now\r\ngenerally available as a load balancing algorithm in Application Gateway for\r\nContainers. This feature improves stability and performance during backend\r\nscale-up by gradually increasing traffic to new pods over a configurable time\r\nwindow.",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Application Gateway for Containers Istio Service Mesh integration",
    "link": "https://azure.microsoft.com/updates?id=525874",
    "description": "Application\r\nGateway for Containers now supports integration with Istio service mesh through\r\nan optional service mesh extension. This feature simplifies secure north-south\r\ncommunication between external clients and services within the service mesh. Single ",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure DocumentDB high-performance storage ",
    "link": "https://azure.microsoft.com/updates?id=525549",
    "description": "Now you can run bigger, faster workloads on fewer nodes using high-performance storage for Azure DocumentDB. This update delivers up to 64 TiB capacity, 80,000 IOPS, and 1,200 MB/s throughput per physical shard (node). Storage IOPS and throughput on Azure",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Model Context Protocol (MCP) tool trigger for Azure Functions ",
    "link": "https://azure.microsoft.com/updates?id=525523",
    "description": "Model\r\nContext Protocol (MCP) is a way for apps to provide capabilities and context to\r\na large language model. A key feature of MCP is the ability to define tools\r\nthat AI agents can leverage to accomplish whatever tasks they’ve been given.\r\nMCP servers can ",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Functions durable task scheduler Dedicated SKU (GA) & Consumption SKU (Public Preview)",
    "link": "https://azure.microsoft.com/updates?id=525518",
    "description": "Earlier this year, we\r\nintroduced Azure Functions durable task scheduler, an orchestration engine\r\ndesigned for complex workflows and intelligent agents. It automatically\r\ncheckpoints progress and protects your orchestration state, enabling resilient\r\nand rel",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Self-hosted remote MCP servers on Azure Functions ",
    "link": "https://azure.microsoft.com/updates?id=525505",
    "description": "We are introducing a new capability that allows you to host\r\nremote Model Context Protocol (MCP) servers built with the MCP SDKs on Functions. Some key benefits of hosting on the Functions platform include:  Built-in server authentication Automatic and bur",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Announcing: Resources for migrating to Azure Functions Flex Consumption ",
    "link": "https://azure.microsoft.com/updates?id=525500",
    "description": "Azure Functions Flex Consumption is\r\nnow the recommended hosting plan for serverless workloads requiring advanced\r\nscaling, networking, and cost optimization. To support customers migrating from\r\nthe Azure Functions Consumption plan or from AWS Lambda, Micro",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Functions enables OpenTelemetry support ",
    "link": "https://azure.microsoft.com/updates?id=525479",
    "description": "Azure Functions now supports\r\nOpenTelemetry in general availability (GA), enabling developers to export logs,\r\ntraces, and metrics using open standards. This release builds on the public\r\npreview and delivers a production-ready observability experience for s",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Container Apps adds support for agentic Docker Compose ",
    "link": "https://azure.microsoft.com/updates?id=525470",
    "description": "Azure Container Apps is bringing the familiar\r\ndeveloper workflow of Docker Compose directly to Azure Container Apps. As one\r\nof the most widely adopted tools among developers, Docker Compose simplifies\r\ndefining and running multi-container applications, and",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Container Apps introduces flexible workload profile ",
    "link": "https://azure.microsoft.com/updates?id=525465",
    "description": "Flexible workload profile represents a new option\r\nthat blends the simplicity of consumption with many of the performance and\r\ncontrol characteristics of dedicated workload profiles. This offers the same\r\neasy-to-understand, pay-per-use serverless model as C",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Container Apps serverless GPUs in additional regions ",
    "link": "https://azure.microsoft.com/updates?id=525460",
    "description": "To\r\nmeet growing demand for GPU-powered workloads, Azure Container Apps serverless GPUs are now generally\r\navailable in additional regions. This expansion enables developers to run AI\r\ninference, model training, and GPU-accelerated workloads with the simplic",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Confidential computing in Azure Container Apps",
    "link": "https://azure.microsoft.com/updates?id=525455",
    "description": "Confidential\r\ncomputing support in Azure Container Apps is now in public preview. This\r\nrelease brings hardware-based Trusted Execution Environments (TEEs) to your\r\ncontainerized workloads. Azure already provides encryption of data at rest and\r\nin transit, an",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Standard V2 NAT Gateway and StandardV2 Public IPs",
    "link": "https://azure.microsoft.com/updates?id=525405",
    "description": "StandardV2 SKU NAT Gateway is now in public preview, delivering next-generation capabilities for scalable and resilient outbound connectivity. New offerings: Zone-Redundancy: Built for high availability in availability zone supported regions. Traffic surv",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: SQL database in Microsoft Fabric",
    "link": "https://azure.microsoft.com/updates?id=525388",
    "description": "SQL database in Fabric is now generally available. Built on the trusted SQL Server and Azure SQL Database engine, this fully SaaS-native solution empowers developers and data professionals to unify operational and analytical workloads with speed, security",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Support for Italian and Portuguese in Azure Cosmos DB for NoSQL full-text search ",
    "link": "https://azure.microsoft.com/updates?id=523824",
    "description": "Azure Cosmos DB for NoSQL now supports Italian and Portuguese languages in full-text search, available today in public preview. This update adds to the list of supported languages, enabling you to build rich, language-aware search experiences that underst",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Cosmos DB MCP ToolKit for Microsoft Foundry Agent Service ",
    "link": "https://azure.microsoft.com/updates?id=523814",
    "description": "Azure Cosmos DB for NoSQL now offers an MCP Toolkit that can be used with Microsoft Foundry  Agent Service, available today in public preview.  This new integration allows you to connect Microsoft Foundry Agents directly to data in Azure Cosmos DB. By dep",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Fuzzy search in Azure Cosmos DB for NoSQL full-text search ",
    "link": "https://azure.microsoft.com/updates?id=523809",
    "description": "Azure Cosmos DB for NoSQL now supports fuzzy search in full-text search. With fuzzy search, you can deliver typo-tolerant, error-resilient search experiences directly within Azure Cosmos DB, helping your users find the right results even when queries or t",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Vector indexing performance improvements in Azure Cosmos DB for NoSQL ",
    "link": "https://azure.microsoft.com/updates?id=523803",
    "description": "This release gives you faster vector inserts and index builds in Azure Cosmos DB for NoSQL, helping you reduce end-to-end ingestion and indexing times for large AI workloads. This improvement is powered by algorithmic enhancements to our vector indexing e",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Float16 data type for vector indexes in Azure Cosmos DB ",
    "link": "https://azure.microsoft.com/updates?id=523796",
    "description": "Azure Cosmos DB now supports float 16 data types for vector indexes. With this update, you can store and query vectors using half-precision floating-point numbers. Using float16 cuts storage usage in half compared to float32, while maintaining high retrie",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Cosmos DB for Visual Studio Code  ",
    "link": "https://azure.microsoft.com/updates?id=523782",
    "description": "Developers today are building more intelligent, connected, and autonomous applications than ever before. From personalized chatbots and copilots to dynamic content engines and decision systems, data is the foundation of these agentic experiences.  Azure C",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Cosmos DB Mirroring in Microsoft Fabric ",
    "link": "https://azure.microsoft.com/updates?id=523773",
    "description": "Now generally available, Azure Cosmos DB Mirroring in Fabric enables you to seamlessly integrate your existing operational workloads with the analytical capabilities of Microsoft Fabric. You can take advantage of the innovations in Fabric, running SQL que",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Cosmos DB in Microsoft Fabric ",
    "link": "https://azure.microsoft.com/updates?id=523768",
    "description": "Now generally available, Cosmos DB in Fabric enables you to build operational and analytical workloads in Microsoft Fabric. You can use the AI-features in Azure Cosmos DB plus the innovations in Fabric to run SQL queries over JSON data and build real-time",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Index Advisor for Azure DocumentDB ",
    "link": "https://azure.microsoft.com/updates?id=523763",
    "description": "Integrated into the DocumentDB for VS Code extension, the Index Advisor enables you to view and debug database performance. It uses natural language to recommend optimal indexing and best practices for your MongoDB workloads.  Learn more. ",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Priority-based execution in Azure Cosmos DB ",
    "link": "https://azure.microsoft.com/updates?id=523754",
    "description": "You can now enable priority-based execution in Azure Cosmos DB to ensure that high-priority requests are favored during periods of contention. The system will throttle low-priority requests first, allowing high-priority operations to proceed on a best-eff",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Cosmos DB Fleet Analytics ",
    "link": "https://azure.microsoft.com/updates?id=523745",
    "description": "You can now unify insights across your entire Azure Cosmos DB footprint using Azure Cosmos DB Fleet Analytics, available in public preview. Fleet Analytics helps you manage data across multiple accounts, subscriptions, and workloads, providing large-scale",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Cosmos DB fleet pools  ",
    "link": "https://azure.microsoft.com/updates?id=523740",
    "description": "Now you can more easily operate your Azure Cosmos DB accounts at scale. Azure Cosmos DB fleet pools give you new capabilities when building multitenant software as a service (SaaS) applications.  You can simplify capacity management by creating a pool of ",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure DocumentDB - an open-source, MongoDB-compatible document database service for hybrid and multicloud",
    "link": "https://azure.microsoft.com/updates?id=523735",
    "description": "Microsoft is announcing the general availability of Azure DocumentDB, a fully managed document database service built on the open-source, MongoDB-compatible DocumentDB, now governed by the Linux Foundation. Formerly known as Azure Cosmos DB for MongoDB (v",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Dynamic data masking with Azure Cosmos DB ",
    "link": "https://azure.microsoft.com/updates?id=523726",
    "description": "You can now help protect sensitive data from unauthorized access using dynamic data masking (DDM), a server-side, policy-based security feature in Azure Cosmos DB. DDM dynamically masks data for non-privileged users, ensuring that sensitive information is",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Online and offline migrations in Azure DocumentDB Migration extension ",
    "link": "https://azure.microsoft.com/updates?id=523721",
    "description": "You can now migrate MongoDB workloads to Azure DocumentDB using the new Azure DocumentDB Migration extension for Visual Studio Code—now available in public preview. This seamless, zero-cost migration supports both online and offline modes, simplifying and",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Online migration from Azure Cosmos DB for MongoDB RU to Azure DocumentDB",
    "link": "https://azure.microsoft.com/updates?id=523716",
    "description": "Announcing the general availability of seamless, self-serve online migrations from Azure Cosmos DB for MongoDB RU to Azure DocumentDB—directly from the Azure portal. With this release, your organization can modernize its MongoDB workloads with zero downti",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Oracle to PostgreSQL migration tooling in Visual Studio Code ",
    "link": "https://azure.microsoft.com/updates?id=523593",
    "description": "Migrating from Oracle to PostgreSQL is now simpler and faster with the new Oracle-to-PostgreSQL migration tooling, available directly in the Azure Database for PostgreSQL extension for Visual Studio Code.  This new tool helps you seamlessly convert your O",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: 2025 REST API for Azure Database for PostgreSQL ",
    "link": "https://azure.microsoft.com/updates?id=523588",
    "description": "Announcing the general availability of the 2025 REST API for Azure Database for PostgreSQL. This release adds support for PostgreSQL 17 and 18, so you can adopt new versions without changing your automation patterns. You can also now set the default datab",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Elastic clusters on Azure Database for PostgreSQL – Flexible Server ",
    "link": "https://azure.microsoft.com/updates?id=523583",
    "description": "Now you can use elastic clusters to horizontally scale Azure Database for PostgreSQL through row-based and schema-based sharding. Elastic clusters make it easy to build multitenant apps by offloading shard management and operations—such as tenant isolatio",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Native Microsoft Foundry support for Azure Database for PostgreSQL",
    "link": "https://azure.microsoft.com/updates?id=523578",
    "description": "Announcing the public preview of Microsoft Foundry support for Azure Database for PostgreSQL. The Azure PostgreSQL MCP Server is now natively integrated with Microsoft Foundry.  This integration enables you to build AI agents to securely query and analyze",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Database for PostgreSQL – Flexible Server anon extension ",
    "link": "https://azure.microsoft.com/updates?id=523569",
    "description": "The anon extension is now generally available in Azure Database for PostgreSQL flexible server. This extension provides data anonymization tools. Learn more. ",
    "pubDate": "2025-11-18T17:01:02.000Z",
    "source": "Azure Updates"
  }
]