[
  {
    "title": "[Launched] Generally Available: Object Replication Priority Replication for Azure Blob",
    "link": "https://azure.microsoft.com/updates?id=522072",
    "description": "Object replication priority replication will\r\nallow users to obtain prioritized replication from the source to the\r\ndestination storage account of their replication policy. When you enable\r\npriority replication, you can benefit from the associated Service Le",
    "pubDate": "2025-11-10T19:30:03.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Geo Priority Replication for Azure Blob",
    "link": "https://azure.microsoft.com/updates?id=522059",
    "description": "Geo\r\npriority replication enhances the replication process for GRS and GZRS storage\r\naccounts by enabling accelerated data replication between the primary and\r\nsecondary regions. This feature is backed by a Service Level Agreement (SLA),\r\nensuring the Last Sy",
    "pubDate": "2025-11-10T19:30:03.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Troubleshoot Azure Firewall using packet capture",
    "link": "https://azure.microsoft.com/updates?id=528969",
    "description": "Packet capture is meant to capture specific flows for customers which can be filtered based on protocol, flags and filters. Packet captures can be initiated via a portal experience or via code using PowerShell.Learn more:For more information on how to use",
    "pubDate": "2025-11-10T18:45:51.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Application Gateway for Containers with Web Application Firewall (WAF)",
    "link": "https://azure.microsoft.com/updates?id=525419",
    "description": "Announcing Azure\r\nWeb\r\nApplication Firewall (WAF) support for Azure\r\nApplication\r\nGateway for Containers is now generally available. Application Gateway for Containers is the\r\nnext evolution of Application Gateway + Application Gateway Ingress Controller.\r\nWith",
    "pubDate": "2025-11-10T17:00:17.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "​​Securing our future: November 2025 progress report on Microsoft’s Secure Future Initiative ​​ ",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/11/10/securing-our-future-november-2025-progress-report-on-microsofts-secure-future-initiative/",
    "description": "<p>When we launched the Secure Future Initiative, our mission was clear: accelerate innovation, strengthen resilience, and lead the industry toward a safer digital future. Today, we’re sharing our latest progress report that reflects steady progress in every area and engineering pillar, underscoring our commitment to security above all else.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/11/10/securing-our-future-november-2025-progress-report-on-microsofts-secure-future-initiative/\">​​Securing our future: November 2025 progress report on Microsoft’s Secure Future Initiative ​​ </a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-11-10T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[In preview] Public Preview: openCypher support for KQL graph semantics",
    "link": "https://azure.microsoft.com/updates?id=522866",
    "description": "Announcing openCypher support for KQL graph semantics, bringing the widely adopted open-source graph query language to your graph data. This update allows you to run openCypher queries on any Fabric Eventhouse or Azure Data Explorer, making it easier to w",
    "pubDate": "2025-11-07T19:00:43.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: labels() function in KQL graph semantics",
    "link": "https://azure.microsoft.com/updates?id=522772",
    "description": "The labels() function in KQL graph semantics is now generally available. This function enables you to retrieve, filter, and project label information for nodes and edges in your graph queries, making it easier to work with categorized graph data.The label",
    "pubDate": "2025-11-07T19:00:43.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Database for PostgreSQL – Flexible Server availability zones expansion in Japan West",
    "link": "https://azure.microsoft.com/updates?id=508408",
    "description": "Now you can deploy Azure Database for PostgreSQL flexible server in all three availability zones in Japan West.Learn more.",
    "pubDate": "2025-11-07T18:45:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "​​Whisper Leak: A novel side-channel attack on remote language models",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/11/07/whisper-leak-a-novel-side-channel-cyberattack-on-remote-language-models/",
    "description": "<p>Microsoft has discovered a side-channel attack on language models which allows adversaries to conclude model conversation topics, despite being encrypted.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/11/07/whisper-leak-a-novel-side-channel-cyberattack-on-remote-language-models/\">​​Whisper Leak: A novel side-channel attack on remote language models</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-11-07T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[Launched] Generally Available: Ultra Disk’s new flexible provisioning model",
    "link": "https://azure.microsoft.com/updates?id=526635",
    "description": "Announcing the General Availability of\r\nUltra Disk’s new flexible provisioning model. This enhancement gives you\r\nthe freedom to configure capacity, IOPS, and throughput (MBPS) more independently—so\r\nyou can tailor performance to your workload needs and opti",
    "pubDate": "2025-11-06T17:00:51.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "New IDC research highlights a major cloud security shift",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/11/06/new-idc-research-highlights-a-major-cloud-security-shift/",
    "description": "<p>New IDC research shows why CISOs must move toward AI-powered, integrated platforms like CNAPP, XDR, and SIEM to reduce risk, cut complexity, and strengthen resilience.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/11/06/new-idc-research-highlights-a-major-cloud-security-shift/\">New IDC research highlights a major cloud security shift</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-11-06T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[Launched] Generally Available: Object Replication Metrics",
    "link": "https://azure.microsoft.com/updates?id=520201",
    "description": "Blob storage Object Replication metrics for pending operations and pending bytes are now generally available in all regions. These replication metrics will empower you to optimize the performance, troubleshoot replication delays, and maintain high availab",
    "pubDate": "2025-11-06T16:00:54.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure MCP Server",
    "link": "https://azure.microsoft.com/updates?id=526881",
    "description": "Give your agents the power of cloud and redefining how developers interact with Azure. Built on Model Context Protocol (MCP), it can create a secure, standards-based bridge between Azure services—like AKS, ACA, App Service, Cosmos DB, SQL, AI Foundry, and",
    "pubDate": "2025-11-06T15:45:17.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: GitHub Copilot in SQL Server Management Studio (SSMS) ",
    "link": "https://azure.microsoft.com/updates?id=520729",
    "description": "GitHub Copilot in SQL Server Management Studio (SSMS) is now available in public preview. GitHub Copilot in SSMS helps you write Transact-SQL (T-SQL) faster and with greater accuracy. Using database and connection context, it can also answer general SQL q",
    "pubDate": "2025-11-06T15:45:17.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure SQL updates for early November 2025  ",
    "link": "https://azure.microsoft.com/updates?id=520715",
    "description": "In early November 2025, the following updates and enhancements were made to Azure SQL:  Azure SQL Hyperscale now supports multiple geo-secondary replicas, making it easier to design and deploy disaster recovery topology spanning multiple regions. Learn mo",
    "pubDate": "2025-11-06T15:45:17.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Database for PostgreSQL read replicas with Premium SSD v2 ",
    "link": "https://azure.microsoft.com/updates?id=520710",
    "description": "You can now configure read replicas (in-region and geo-replicas) with Premium SSD v2 storage tier in Azure Database for PostgreSQL flexible server. Read replicas enable you to scale out read-heavy workloads and improve performance by offloading read opera",
    "pubDate": "2025-11-06T15:45:17.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Planned Failover for Azure Storage",
    "link": "https://azure.microsoft.com/updates?id=522086",
    "description": "Planned Failover is a customer-managed failover that\r\nprovides the ability to failover your geo-redundant storage account while\r\nkeeping geo-redundancy and data durability. You can seamlessly swap the\r\nprimary and secondary storage endpoints of your geo-redu",
    "pubDate": "2025-11-05T22:30:04.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Driving ROI with Azure AI Foundry and UiPath: Intelligent agents in real-world healthcare workflows",
    "link": "https://azure.microsoft.com/en-us/blog/driving-roi-with-azure-ai-foundry-and-uipath-intelligent-agents-in-real-world-healthcare-workflows/",
    "description": "<p>Automate healthcare workflows with Azure AI Foundry and UiPath to improve efficiency, reduce costs, and deliver real ROI across patient care.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/driving-roi-with-azure-ai-foundry-and-uipath-intelligent-agents-in-real-world-healthcare-workflows/\">Driving ROI with Azure AI Foundry and UiPath: Intelligent agents in real-world healthcare workflows</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-11-05T18:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "[Launched] Generally Available: Monitor end-to-end ExpressRoute connectivity with Connection Monitor",
    "link": "https://azure.microsoft.com/updates?id=525442",
    "description": "Connection Monitor integration streamlines the setup of end-to-end\r\nmonitoring for ExpressRoute workloads. With this capability, you can now enable\r\nConnection Monitor directly while creating or updating your ExpressRoute\r\nconnections. This removes the need ",
    "pubDate": "2025-11-05T17:00:26.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: ExpressRoute resiliency insights",
    "link": "https://azure.microsoft.com/updates?id=525424",
    "description": "Resiliency\r\ninsights is an assessment capability designed to measure your network's\r\nreliability for ExpressRoute workloads. At the core of this capability is the resiliency\r\nindex, a percentage score calculated based on factors such as route\r\nresilience, zon",
    "pubDate": "2025-11-05T17:00:26.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Database for MySQL – Flexible Server now supports high availability with dedicated Azure Standard Load Balancer ",
    "link": "https://azure.microsoft.com/updates?id=520705",
    "description": "Announcing the general availability of a dedicated Azure Standard Load Balancer in Azure Database for MySQL - Flexible Server for high availability-enabled servers. With this feature, a high availability configuration gets the benefit of a dedicated Stand",
    "pubDate": "2025-11-05T17:00:26.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Query Advisor in Azure Cosmos DB ",
    "link": "https://azure.microsoft.com/updates?id=520696",
    "description": "Azure Cosmos DB for NoSQL includes Query Advisor, now generally available in the .NET SDK. Query Advisor helps you write faster, more efficient queries by analyzing your query structure and providing clear, actionable recommendations. It identifies ways t",
    "pubDate": "2025-11-05T17:00:26.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: ORDER BY ST_DISTANCE in Azure Cosmos DB for NoSQL Geospatial Queries ",
    "link": "https://azure.microsoft.com/updates?id=520691",
    "description": "Azure Cosmos DB for NoSQL now supports ORDER BY ST_DISTANCE for geospatial queries, now generally available. With this feature, you can sort query results by their distance from a given point or GeoJSON object directly within Azure Cosmos DB. You no longe",
    "pubDate": "2025-11-05T17:00:26.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "​​Securing critical infrastructure: Why Europe’s risk-based regulations matter",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/11/05/securing-critical-infrastructure-why-europes-risk-based-regulations-matter/",
    "description": "<p>Learn how CISOs can use new European Union legislation to strengthen their cybersecurity measures.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/11/05/securing-critical-infrastructure-why-europes-risk-based-regulations-matter/\">​​Securing critical infrastructure: Why Europe’s risk-based regulations matter</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-11-05T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[Launched] Generally Available: ExpressRoute resiliency validation",
    "link": "https://azure.microsoft.com/updates?id=525429",
    "description": "Resiliency validation is a capability designed to assess\r\nthe resiliency of network connectivity for ExpressRoute-enabled workloads. This\r\nfeature allows you to perform site failovers for your Virtual Network Gateway,\r\nhelping to evaluate network resiliency ",
    "pubDate": "2025-11-05T16:30:07.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Open Source: Announcing the DocumentDB Kubernetes Operator ",
    "link": "https://azure.microsoft.com/updates?id=520686",
    "description": "Now you can use the open-source DocumentDB Kubernetes Operator to run DocumentDB on Kubernetes. DocumentDB is a Mongo-DB–compatible, open-source document database built on PostgreSQL. The operator extends Kubernetes with custom resource definitions (CRDs)",
    "pubDate": "2025-11-05T16:00:17.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Microsoft strengthens sovereign cloud capabilities with new services",
    "link": "https://azure.microsoft.com/en-us/blog/microsoft-strengthens-sovereign-cloud-capabilities-with-new-services/",
    "description": "<p>We continue to adapt our sovereignty approach—innovating to meet customer needs and regulatory requirements within our Sovereign Public Cloud and Sovereign Private Cloud. We are announcing a new wave of capabilities, building upon our digital sovereignty controls, to deliver advanced AI and scale, strengthened by our ecosystem of specialized in-country partner experts.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/microsoft-strengthens-sovereign-cloud-capabilities-with-new-services/\">Microsoft strengthens sovereign cloud capabilities with new services</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-11-05T07:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Powering Distributed AI/ML at Scale with Azure and Anyscale",
    "link": "https://devblogs.microsoft.com/all-things-azure/powering-distributed-aiml-at-scale-with-azure-and-anyscale/",
    "description": "<p>The path from prototype to production for AI/ML workloads is rarely straightforward. As data pipelines expand and model complexity grows, teams can find themselves spending more time orchestrating distributed compute than building the intelligence that powers their products. Scaling from a laptop experiment to a production-grade workload still feels like reinventing the wheel. What if scaling AI workloads felt as natural as writing in Python itself? That’s the idea behind Ray, the open-source distributed computing framework born at UC Berkeley’s RISELab, and now, it’s coming to Azure in a whole new way.</p>\n<p>The post <a href=\"https://devblogs.microsoft.com/all-things-azure/powering-distributed-aiml-at-scale-with-azure-and-anyscale/\">Powering Distributed AI/ML at Scale with Azure and Anyscale</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-11-04T20:58:41.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "​​Learn what generative AI can do for your security operations center",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/11/04/learn-what-generative-ai-can-do-for-your-security-operations-center-soc/",
    "description": "<p>This new e-book showcases what generative AI can do for your SOC, from reducing alert fatigue and enabling quicker triage to getting ahead of cyberattacks with proactive threat hunting, and more.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/11/04/learn-what-generative-ai-can-do-for-your-security-operations-center-soc/\">​​Learn what generative AI can do for your security operations center</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-11-04T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[In preview] Public Preview: Azure NetApp Files Object REST API ",
    "link": "https://azure.microsoft.com/updates?id=516643",
    "description": "The Object REST API, an S3-compatible REST API, on Azure NetApp Files bridges the gap between traditional file-based storage and modern cloud services, enabling customers to use their existing data in new ways. By providing integration via Microsoft Fabri",
    "pubDate": "2025-11-03T17:30:04.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "DR for Azure Data Platform - Architecture",
    "link": "https://learn.microsoft.com/azure/architecture/data-guide/disaster-recovery/dr-for-azure-data-platform-architecture",
    "description": "Second article in a series covering disaster recovery for an Azure data platform",
    "pubDate": "2025-11-03T17:27:11.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Enhancing software supply chain security with Microsoft’s Signing Transparency",
    "link": "https://azure.microsoft.com/en-us/blog/enhancing-software-supply-chain-security-with-microsofts-signing-transparency/",
    "description": "<p>Microsoft is announcing the preview of Signing Transparency to address software supply chain threats that traditional code signing alone cannot fully prevent, building on the Zero Trust principle of “never trust, always verify.” Signing Transparency uses an append-only log to verifiably record each signature, with keys protected in a secure confidential computing enclave.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/enhancing-software-supply-chain-security-with-microsofts-signing-transparency/\">Enhancing software supply chain security with Microsoft&#8217;s Signing Transparency</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-11-03T17:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "SesameOp: Novel backdoor uses OpenAI Assistants API for command and control",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/11/03/sesameop-novel-backdoor-uses-openai-assistants-api-for-command-and-control/",
    "description": "<p>Microsoft Incident Response – Detection and Response Team (DART) researchers uncovered a new backdoor that is notable for its novel use of the OpenAI Assistants Application Programming Interface (API) as a mechanism for command-and-control (C2) communications. Instead of relying on more traditional methods, the threat actor behind this backdoor abuses OpenAI as a C2 channel as a way to stealthily communicate and orchestrate malicious activities within the compromised environment. To do this, a component of the backdoor uses the OpenAI Assistants API as a storage or relay mechanism to fetch commands and run tasks for the threat actor.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/11/03/sesameop-novel-backdoor-uses-openai-assistants-api-for-command-and-control/\">SesameOp: Novel backdoor uses OpenAI Assistants API for command and control</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-11-03T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "Data and AI",
    "link": "https://learn.microsoft.com/azure/architecture/aws-professional/data-ai",
    "description": "Compare Azure data and AI services to corresponding AWS services. Understand key differences in data integration, analytics, machine learning, and AI capabilities.",
    "pubDate": "2025-11-01T00:03:16.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "GitOps for Azure Kubernetes Service",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/gitops-aks/gitops-blueprint-aks",
    "description": "Learn techniques for using GitOps principles to operate and manage an Azure Kubernetes Services (AKS) cluster. The solutions use Flux v2 and Argo CD.",
    "pubDate": "2025-10-31T23:48:42.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Advanced Azure Kubernetes Service (AKS) Microservices Architecture",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-microservices/aks-microservices-advanced",
    "description": "Learn about a scalable, secure AKS microservices architecture that builds on recommended AKS microservices baseline architectures and implementations.",
    "pubDate": "2025-10-31T22:55:58.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Resiliency in the cloud—empowered by shared responsibility and Azure Essentials",
    "link": "https://azure.microsoft.com/en-us/blog/resiliency-in-the-cloud-empowered-by-shared-responsibility-and-azure-essentials/",
    "description": "<p>Empowering organizations to shape the future of cloud with resilient, always-on solutions.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/resiliency-in-the-cloud-empowered-by-shared-responsibility-and-azure-essentials/\">Resiliency in the cloud—empowered by shared responsibility and Azure Essentials</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-31T16:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Greenfield Lakehouse on Microsoft Fabric",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/data/greenfield-lakehouse-fabric",
    "description": "Learn about a greenfield solution for creating a robust, scalable data platform by using the lakehouse design paradigm on Microsoft Fabric.",
    "pubDate": "2025-10-31T10:26:04.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "The journey to SaaS: Dynamics 365",
    "link": "https://learn.microsoft.com/azure/architecture/guide/saas/case-studies/dynamics-365-journey-saas",
    "description": "Learn from a first-hand account about the journey and decisions that made Microsoft Dynamics 365 a successful SaaS product.",
    "pubDate": "2025-10-30T21:45:04.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Multi-region load balancing",
    "link": "https://learn.microsoft.com/azure/architecture/high-availability/reference-architecture-traffic-manager-application-gateway",
    "description": "Learn how to build an Azure system that serves web and non-web workloads with resilient multi-tier applications in multiple Azure regions.",
    "pubDate": "2025-10-30T21:45:04.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[In preview] Public Preview: Azure Functions zero-downtime deployments with rolling updates in Flex Consumption",
    "link": "https://azure.microsoft.com/updates?id=520822",
    "description": "Azure Functions now supports rolling updates in the Flex Consumption plan, delivering zero-downtime deployments with a simple configuration change.  Instead of forcefully restarting all instances during code or configuration updates, the platform graceful",
    "pubDate": "2025-10-30T18:00:45.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "The 5 generative AI security threats you need to know about detailed in new e-book",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/30/the-5-generative-ai-security-threats-you-need-to-know-about-detailed-in-new-e-book/",
    "description": "<p>In this blog post, we’ll highlight the key themes covered in the e-book, including the challenges organizations face, the top generative AI threats to organizations, and how companies can enhance their security posture to meet the dangers of today’s unpredictable AI environments.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/30/the-5-generative-ai-security-threats-you-need-to-know-about-detailed-in-new-e-book/\">The 5 generative AI security threats you need to know about detailed in new e-book</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-30T18:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[Launched] Generally Available: High Scale Private Endpoints  ",
    "link": "https://azure.microsoft.com/updates?id=522813",
    "description": "You can now increase Azure Private Endpoint’s virtual network (VNet) limits by upgrading to High Scale Private Endpoints (HSPE). Today local VNet limits are restricted to 1,000 private endpoints per Virtual Network. Any attempts to create additional endpo",
    "pubDate": "2025-10-30T16:30:43.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Instant Access Snapshots for Azure Premium SSD v2 and Ultra Disks Storage",
    "link": "https://azure.microsoft.com/updates?id=520805",
    "description": "Announcing the Public Preview of Instant Access Snapshots\r\nfor Premium SSD v2 (Pv2) and Ultra Disks. This new capability enables you\r\nto restore new disks immediately after creating snapshots of Pv2 and Ultra\r\ndisks. Restore disks deliver high performance in",
    "pubDate": "2025-10-30T16:00:54.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Support for Node.js 20 ends on April 30, 2026 – upgrade your apps to Node.js 22 ",
    "link": "https://azure.microsoft.com/updates?id=502957",
    "description": "In alignment with the end of community\r\nsupport, on April 30, 2026, support for Node.js 20 in Azure Functions will end.\r\nYour apps that are hosted on Functions will continue to run, but security\r\nupdates and performance optimizations will no longer be availa",
    "pubDate": "2025-10-30T16:00:54.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "GitHub Universe 2025: Where developer innovation took center stage",
    "link": "https://azure.microsoft.com/en-us/blog/github-universe-2025-where-developer-innovation-took-center-stage/",
    "description": "<p>At GitHub Universe 2025, the theme was clear: the ability to see, steer, and build across agents will bring the greatest impact.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/github-universe-2025-where-developer-innovation-took-center-stage/\">GitHub Universe 2025: Where developer innovation took center stage</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-30T15:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Improper Instantiation antipattern",
    "link": "https://learn.microsoft.com/azure/architecture/antipatterns/improper-instantiation",
    "description": "Avoid continually creating new instances of an object that is meant to be created once and then shared.",
    "pubDate": "2025-10-30T14:46:59.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Web API Implementation",
    "link": "https://learn.microsoft.com/azure/architecture/best-practices/api-implementation",
    "description": "Learn about best practices for implementing a web API and publishing it to make it available to client applications.",
    "pubDate": "2025-10-30T14:46:59.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Background jobs guidance",
    "link": "https://learn.microsoft.com/azure/architecture/best-practices/background-jobs",
    "description": "Learn about background tasks that run independently of the user interface, such as batch jobs, intensive processing tasks, and long-running processes.",
    "pubDate": "2025-10-30T14:46:59.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Data partitioning guidance",
    "link": "https://learn.microsoft.com/azure/architecture/best-practices/data-partitioning",
    "description": "View guidance for how to separate data partitions to be managed and accessed separately. Understand horizontal, vertical, and functional partitioning strategies.",
    "pubDate": "2025-10-30T14:46:59.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Data partitioning strategies",
    "link": "https://learn.microsoft.com/azure/architecture/best-practices/data-partitioning-strategies",
    "description": "View guidance on separating data partitions to be managed and accessed separately in different services, such as Azure AI Search, Azure storage queues, and more.",
    "pubDate": "2025-10-30T14:46:59.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Monitoring and diagnostics guidance",
    "link": "https://learn.microsoft.com/azure/architecture/best-practices/monitoring",
    "description": "Learn how to track how users use your distributed applications and services, trace resource utilization, and monitor the health and performance.",
    "pubDate": "2025-10-30T14:46:59.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "API design",
    "link": "https://learn.microsoft.com/azure/architecture/microservices/design/api-design",
    "description": "Learn about good API design in a microservices architecture. APIs should be efficient and have well-defined semantics and versioning schemes.",
    "pubDate": "2025-10-30T14:32:11.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Retirement: Remove dependency on these preview features before March 31, 2026 ",
    "link": "https://azure.microsoft.com/updates?id=501663",
    "description": "On March 31, 2026, the following preview features will be retired:  Group multiple steps as a whole to better organize complex pipelines  Compare pipeline jobs to debug failures or unexpected issues  Import data into a data labelling project  Use v2 data ",
    "pubDate": "2025-10-29T21:00:13.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Baseline architecture for an AKS cluster",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks/baseline-aks",
    "description": "Learn about the reference architecture for the recommended baseline infrastructure that deploys an Azure Kubernetes Service (AKS) cluster.",
    "pubDate": "2025-10-29T09:50:13.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Building the future together: Microsoft and NVIDIA announce AI advancements at GTC DC",
    "link": "https://azure.microsoft.com/en-us/blog/building-the-future-together-microsoft-and-nvidia-announce-ai-advancements-at-gtc-dc/",
    "description": "<p>New offerings in Azure AI Foundry give businesses an enterprise-grade platform to build, deploy, and scale AI applications and agents.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/building-the-future-together-microsoft-and-nvidia-announce-ai-advancements-at-gtc-dc/\">Building the future together: Microsoft and NVIDIA announce AI advancements at GTC DC</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-28T18:30:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "[In preview] Public Preview: Signed request on Azure Front Door ",
    "link": "https://azure.microsoft.com/updates?id=501169",
    "description": "We’re announcing the public preview of Azure Front Door signed request, a powerful new feature designed to enhance access control for content delivery. This capability allows organizations to restrict access to their content—such as media streams, file do",
    "pubDate": "2025-10-28T18:00:34.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure WAF CAPTCHA Challenge for Azure Front Door ",
    "link": "https://azure.microsoft.com/updates?id=512751",
    "description": "Announcing the General Availability of CAPTCHA for Azure Web Application Firewall (WAF) with Azure Front Door.Modern web applications face evolving threats, including bots, web scrapers, and brute-force attacks, many of which can bypass traditional securi",
    "pubDate": "2025-10-28T16:45:07.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Introducing Agent HQ: Any agent, any way you work",
    "link": "https://github.blog/news-insights/company-news/welcome-home-agents/?utm_source=MSFT-day1-blog&utm_medium=social&utm_campaign=universe25",
    "description": "<p>At Universe 2025, GitHub’s next evolution introduces a single, unified workflow for developers to be able to orchestrate any agent, any time, anywhere.</p>\n<p>The post <a href=\"https://github.blog/news-insights/company-news/welcome-home-agents/?utm_source=MSFT-day1-blog&#038;utm_medium=social&#038;utm_campaign=universe25\">Introducing Agent HQ: Any agent, any way you work</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-28T16:38:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "[Launched] Generaly Available: Azure Sphere OS version 25.10 is now available for evaluation",
    "link": "https://azure.microsoft.com/updates?id=519310",
    "description": "Azure Sphere OS version 25.10 is now available for evaluation in the Retail Eval feed. The retail evaluation period for this release provides 14 days (about 2 weeks) of testing. During this time, please verify that your applications and devices operate pr",
    "pubDate": "2025-10-28T14:15:20.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Azure Virtual Machines baseline architecture",
    "link": "https://learn.microsoft.com/azure/architecture/virtual-machines/baseline",
    "description": "Learn how to set up an environment that's configured to run a workload on Azure Virtual Machines.",
    "pubDate": "2025-10-28T13:50:14.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Multitenancy and Azure OpenAI",
    "link": "https://learn.microsoft.com/azure/architecture/guide/multitenant/service/openai",
    "description": "Learn how to deploy Azure OpenAI models and work with the features associated with each model when you have a multitenant system.",
    "pubDate": "2025-10-28T02:55:35.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[Launched] Generally Available: Azure Storage Mover support for NFS source to Azure File Share (NFS 4.1) target",
    "link": "https://azure.microsoft.com/updates?id=514658",
    "description": "Azure Storage Mover can now migrate your NFS File shares to Azure File Shares (NFS 4.1). Storage Mover is a fully managed migration service that enables you to migrate on-premises files and folders to Azure Storage while minimizing downtime for your workl",
    "pubDate": "2025-10-27T18:45:01.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: PgBouncer 1.23.1 support in Azure Database for PostgreSQL – Flexible Server ",
    "link": "https://azure.microsoft.com/updates?id=513254",
    "description": "PgBouncer 1.23.1 is now generally available in Azure Database for PostgreSQL – Flexible Server. As a built-in connection pooling feature, PgBouncer helps you scale to thousands of connections with low overhead by efficiently managing idle and short-lived ",
    "pubDate": "2025-10-27T18:30:05.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: RHEL Software Reservations Now Available on Azure with Updated Pricing",
    "link": "https://azure.microsoft.com/updates?id=519526",
    "description": "Red Hat\r\nEnterprise Linux (RHEL) software reservations are now available again for\r\npurchase on Azure following important updates to billing meters and pricing.\r\nThis update addresses issues with previous billing meters and aligns with Red\r\nHat's new pricing ",
    "pubDate": "2025-10-27T16:45:57.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Minimal storage – change feed to replicate data",
    "link": "https://learn.microsoft.com/azure/architecture/databases/idea/minimal-storage-change-feed-replicate-data",
    "description": "Architecture for a high-availability solution that uses two Azure storage services, one for quick access to high-demand data, the other for low-demand data.",
    "pubDate": "2025-10-24T14:18:34.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Building the First Layer of Defense with Azure Security Services",
    "link": "https://learn.microsoft.com/azure/architecture/solution-ideas/articles/azure-security-build-first-layer-defense",
    "description": "Secure your IT environment by using Azure security services and Azure Security Benchmark. This article is part of a series.",
    "pubDate": "2025-10-24T13:18:06.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Virtual Network Connectivity Options and Spoke-To-Spoke Communication",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/hybrid-networking/virtual-network-peering",
    "description": "Compare virtual network peering and VPN gateways for Azure connectivity. Learn spoke-to-spoke communication patterns in hub-and-spoke architectures.",
    "pubDate": "2025-10-23T22:02:33.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Fully managed cloud-to-cloud transfers with Azure Storage Mover",
    "link": "https://azure.microsoft.com/en-us/blog/fully-managed-cloud-to-cloud-transfers-with-azure-storage-mover/",
    "description": "<p>Move data from Files Shares and NAS Storage into Azure Object and File storage with minimal disruption.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/fully-managed-cloud-to-cloud-transfers-with-azure-storage-mover/\">Fully managed cloud-to-cloud transfers with Azure Storage Mover</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-23T16:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Harden your identity defense with improved protection, deeper correlation, and richer context",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/23/harden-your-identity-defense-with-improved-protection-deeper-correlation-and-richer-context/",
    "description": "<p>Expanded ITDR features—including the new Microsoft Defender for Identity sensor, now generally available—bring improved protection, correlation, and context to help customers modernize their identity defense.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/23/harden-your-identity-defense-with-improved-protection-deeper-correlation-and-richer-context/\">Harden your identity defense with improved protection, deeper correlation, and richer context</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-23T16:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "Retirement: Azure Computer Vision – Image Analysis will be retired on September 25, 2028 ",
    "link": "https://azure.microsoft.com/updates?id=502909",
    "description": "Microsoft is announcing the planned retirement of the Azure Computer Vision – Image Analysis service. \t Microsoft will provide full support for all existing Azure Computer Vision – Image Analysis customers until 9/25/2028. During this support window, cust",
    "pubDate": "2025-10-23T14:15:03.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: VM vCore customization features disabling simultaneous multi-threading (SMT/HT) and constrained cores",
    "link": "https://azure.microsoft.com/updates?id=516990",
    "description": "Azure announces the public preview of VM Customization\r\nfeatures, a new capability that gives customers greater control over virtual CPU\r\nconfigurations to optimize performance and licensing costs. This feature\r\nintroduces two powerful options: Disable Simul",
    "pubDate": "2025-10-22T17:15:22.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure SQL updates for mid-October 2025   ",
    "link": "https://azure.microsoft.com/updates?id=513240",
    "description": "In mid-October 2025, the following updates and enhancements were made to Azure SQL:   Improve the redirect connection type to require only port 1433 and promote to default. Learn more. Convert Azure SQL Database to Hyperscale while preserving existing geo",
    "pubDate": "2025-10-22T16:30:07.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Near-zero downtime scaling for HA-enabled Azure Database for PostgreSQL servers ",
    "link": "https://azure.microsoft.com/updates?id=502004",
    "description": "You can now scale your Azure Database for PostgreSQL servers that have high availability (HA) enabled with minimal impact to your users. The process usually takes less than 30 seconds, while traditional scaling can take 2 to 10 minutes. This new capabilit",
    "pubDate": "2025-10-22T16:00:32.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Microsoft named a Leader in the 2025 Gartner® Magic Quadrant™ for Distributed Hybrid Infrastructure",
    "link": "https://azure.microsoft.com/en-us/blog/microsoft-named-a-leader-in-the-2025-gartner-magic-quadrant-for-distributed-hybrid-infrastructure/",
    "description": "<p>We’re proud that Microsoft has once again been named a Leader in the 2025 Gartner® Magic Quadrant™ for Distributed Hybrid Infrastructure.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/microsoft-named-a-leader-in-the-2025-gartner-magic-quadrant-for-distributed-hybrid-infrastructure/\">Microsoft named a Leader in the 2025 Gartner® Magic Quadrant™ for Distributed Hybrid Infrastructure</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-22T16:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "The CISO imperative: Building resilience in an era of accelerated cyberthreats",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/22/the-ciso-imperative-building-resilience-in-an-era-of-accelerated-cyberthreats/",
    "description": "<p>The latest Microsoft Digital Defense Report 2025 paints a vivid picture of a cyberthreat landscape in flux. The surge in financially motivated cyberattacks and the persistent risk of nation-state actors demand urgent attention. But for those of us in the Office of the CISO, the real challenge, and opportunity, lies in how organizations respond, adapt, and build resilience for what comes next.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/22/the-ciso-imperative-building-resilience-in-an-era-of-accelerated-cyberthreats/\">The CISO imperative: Building resilience in an era of accelerated cyberthreats</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-22T16:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "Basic Azure AI Foundry Chat Reference Architecture",
    "link": "https://learn.microsoft.com/azure/architecture/ai-ml/architecture/basic-azure-ai-foundry-chat",
    "description": "Establish foundational knowledge for how to build and deploy enterprise chat applications by using Azure AI Foundry and Azure App Service.",
    "pubDate": "2025-10-21T21:43:35.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "The new Microsoft Security Store unites partners and innovation",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/21/the-new-microsoft-security-store-unites-partners-and-innovation/",
    "description": "<p>The Microsoft Security Store is the gateway for customers to easily discover, buy, and deploy trusted security solutions and AI agents from leading partners.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/21/the-new-microsoft-security-store-unites-partners-and-innovation/\">The new Microsoft Security Store unites partners and innovation</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-21T16:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "Basic Web Application",
    "link": "https://learn.microsoft.com/azure/architecture/web-apps/app-service/architectures/basic-web-app",
    "description": "Learn about proven practices for deploying web applications that use Azure App Service and Azure SQL Database.",
    "pubDate": "2025-10-21T14:46:22.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Choose an Azure Service for Vector Search",
    "link": "https://learn.microsoft.com/azure/architecture/guide/technology-choices/vector-search",
    "description": "Learn how to use this information to decide which Azure service for vector search best suits your application.",
    "pubDate": "2025-10-20T21:35:02.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[Launched] Generally Available: Cloud-to-Cloud migration made simple with Azure Storage Mover",
    "link": "https://azure.microsoft.com/updates?id=514653",
    "description": "Azure Storage Mover’s new AWS S3 to Azure Blob migration feature\r\nis now generally available, empowering organizations to move data directly from\r\nAWS to Azure securely, reliably, and at scale. With this\r\nrelease, customers can eliminate manual pipelines and",
    "pubDate": "2025-10-20T21:00:03.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Open Source: Containerization Assist MCP Server ",
    "link": "https://azure.microsoft.com/updates?id=503268",
    "description": "Containerization Assist solves the\r\nchallenge of manual, error-prone containerization by automating Dockerfile creation\r\nand Kubernetes manifest generation. Unlike basic AI coding tools, it is a full\r\ncontainerization platform built on AKS Draft’s proven rea",
    "pubDate": "2025-10-20T21:00:03.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Sharing Capacity Reservation Groups",
    "link": "https://azure.microsoft.com/updates?id=516897",
    "description": "The ability to share Capacity Reservation\r\nGroups (CRGs) with subscriptions is now in Public Preview.  Previously, customers could deploy VMs in a Capacity\r\nReservation Group within the same subscription only. On-demand Capacity\r\nReservation Group (CRG) can ",
    "pubDate": "2025-10-20T17:15:20.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Enhanced cloning and Public IP retention scripts for Azure Application Gateway migration",
    "link": "https://azure.microsoft.com/updates?id=517027",
    "description": "Azure Application\r\nGateway introduces two new PowerShell scripts to simplify migration from V1\r\n(Standard or WAF) to V2 (Standard_V2 or WAF_V2) services.  As V1 SKUs’ is scheduled to retire by April 2026, we advise\r\nmigrating early and take advantage of Appl",
    "pubDate": "2025-10-20T17:00:28.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In development] Private Preview: New planned datacenter region in Malaysia (Southeast Asia 3)",
    "link": "https://azure.microsoft.com/updates?id=513752",
    "description": "Microsoft is expanding its digital infrastructure footprint further with a new datacenter region, Southeast Asia 3, planned in Malaysia. This datacenter region will feature Microsoft's most comprehensive and strategic cloud services, designed to support a",
    "pubDate": "2025-10-17T15:15:35.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: New OS SKU enum to migrate to Azure Linux 3.0 ",
    "link": "https://azure.microsoft.com/updates?id=512396",
    "description": "You can now\r\nmigrate to Azure Linux 3.0 with a new OS SKU enum, ‘AzureLinux3’, in Kubernetes\r\nversion 1.28-1.36.   This new\r\noption provides increased control over OS upgrades by decoupling them from Kubernetes\r\nupgrades. Customers using LTS version 1.28-1.31",
    "pubDate": "2025-10-17T15:15:35.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Functions support for Python 3.13 ",
    "link": "https://azure.microsoft.com/updates?id=512374",
    "description": "You can now\r\ndevelop functions using Python 3.13 locally and deploy them to Azure Functions.   Starting with\r\nPython 3.13, Functions introduces runtime version control, a new opt-in\r\nfeature that lets you target specific versions of the Functions Python runt",
    "pubDate": "2025-10-17T15:00:03.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Generative AI Operations for Organizations with MLOps Investments",
    "link": "https://learn.microsoft.com/azure/architecture/ai-ml/guide/genaiops-for-mlops",
    "description": "Extend existing MLOps investments to include generative AI operations. Learn where you can apply existing investments and where you need to extend those investments.",
    "pubDate": "2025-10-17T13:55:05.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[Launched] Generally Available: Prescaling in Azure Firewall ",
    "link": "https://azure.microsoft.com/updates?id=515452",
    "description": "Azure Firewall now supports prescaling, a feature that enables admins to provision and reserve capacity units in advance to handle expected traffic loads – such as seasonal peaks or planned business events. This helps to ensure consistent throughput, fast",
    "pubDate": "2025-10-16T16:15:32.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Confidential Containers preview on AKS is Closing Down",
    "link": "https://azure.microsoft.com/updates?id=502044",
    "description": "The public preview of Confidential Containers on AKS will be shutting down.This feature has been available in preview since 2023, and as part of our commitment to delivering secure and reliable services, we are streamlining our confidential computing offe",
    "pubDate": "2025-10-16T16:15:32.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Observed capacity metric in Azure Firewall ",
    "link": "https://azure.microsoft.com/updates?id=516002",
    "description": "Azure Firewall\r\nnow includes the observed capacity metric — a new observability signal designed\r\nto help administrators understand how their firewalls are scaling in practice.\r\nObserved capacity tracks the number of capacity units actively utilized over\r\ntime",
    "pubDate": "2025-10-16T16:00:55.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: PowerShell, Az cmdlets, and Python SDK for Azure Database Migration Service  ",
    "link": "https://azure.microsoft.com/updates?id=500775",
    "description": "Announcing the general availability (GA) of automation support for Azure Database Migration Service (DMS) through PowerShell, custom cmdlets, and the Python SDK. Using Azure PowerShell Az.DataMigration or Azure CLI az datamigration, you can migrate databa",
    "pubDate": "2025-10-15T22:15:50.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Availability Zones and network restricted Key Vault and App Configuration references for Flex Consumption ",
    "link": "https://azure.microsoft.com/updates?id=512379",
    "description": "You can now enable\r\navailability zones for your Azure Functions Flex Consumption apps during both\r\ncreation and post-deployment. When enabled, instances are automatically\r\ndistributed across zones, enhancing reliability and fault tolerance. New Region\r\nSuppor",
    "pubDate": "2025-10-15T18:00:12.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Storage Discovery",
    "link": "https://azure.microsoft.com/updates?id=515479",
    "description": "Azure Storage Discovery provides enterprise-wide\r\nvisibility into your Azure Storage data estate. Insights that weren’t available before are now at\r\nyour fingertips. Deeply analyze\r\nused capacity and activity, optimize costs, enhance\r\nsecurity, and drive oper",
    "pubDate": "2025-10-15T17:00:38.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: SAP Business Data Cloud Connect to Azure Databricks",
    "link": "https://azure.microsoft.com/updates?id=511743",
    "description": "SAP Business Data Cloud (BDC) Connect to Azure Databricks is now generally available, enabling secure, bi-directional, zero-copy data sharing between SAP BDC and Azure Databricks using Delta Sharing, so teams can unify SAP and external data for analytics,",
    "pubDate": "2025-10-15T17:00:38.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Private Link Service Direct Connect",
    "link": "https://azure.microsoft.com/updates?id=503988",
    "description": "Azure\r\nPrivate Link service\r\nallows you to make your applications available to your customers privately and\r\nsecurely. The current setup procedure requires you to configure a private link\r\nservice and place applications behind a standard load balancer. Privat",
    "pubDate": "2025-10-15T17:00:38.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: The F, Fs, Fsv2, Lsv2, G, Gs, Av2, Amv2, and B series VMs are retiring in 2028",
    "link": "https://azure.microsoft.com/updates?id=500682",
    "description": "The F, Fs, Fsv2, Lsv2, G, Gs, Av2, Amv2, and B series of Azure Virtual Machines will retire on November 15th, 2028. These VMs will no longer be able to be used or purchased after this date.   To ensure any applications and workloads running on these VMs w",
    "pubDate": "2025-10-15T16:15:01.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Locations API Update for UK Azure Regions",
    "link": "https://azure.microsoft.com/updates?id=513376",
    "description": "To align with evolving compliance and regulatory requirements, Azure is updating the geographyGroup and regionalDisplayName metadata for UK-based regions in the Locations API.  These changes will take effect this month, October 2025, and will apply to the",
    "pubDate": "2025-10-15T16:00:24.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Use Azure Databricks to Orchestrate MLOps",
    "link": "https://learn.microsoft.com/azure/architecture/ai-ml/idea/orchestrate-machine-learning-azure-databricks",
    "description": "Learn about an approach for machine learning operations (MLOps) that uses Azure Databricks to run model training and batch scoring.",
    "pubDate": "2025-10-15T15:32:46.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "What’s new in Copilot Studio: September 2025",
    "link": "https://www.microsoft.com/en-us/microsoft-copilot/blog/copilot-studio/whats-new-in-copilot-studio-september-2025/",
    "description": "<p>In the September 2025 edition of our monthly roundup, we’re recapping the most exciting new features recently released in Microsoft Copilot Studio. </p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/microsoft-copilot/blog/copilot-studio/whats-new-in-copilot-studio-september-2025/\">What’s new in Copilot Studio: September 2025</a> appeared first on <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog\">Microsoft 365 Blog</a>.</p>\n",
    "pubDate": "2025-10-15T15:00:00.000Z",
    "source": "Microsoft 365"
  }
]