[
  {
    "title": "Retirement: General Purpose v1 (GPv1) and legacy blob storage accounts  ",
    "link": "https://azure.microsoft.com/updates?id=496964",
    "description": "As part of our ongoing efforts to streamline the Azure Storage portfolio and deliver enhanced performance, scalability, and cost efficiency, we are announcing the retirement of all General purpose v1 (GPv1) storage accounts. This includes legacy blob stor",
    "pubDate": "2025-10-03T14:15:21.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Microsoft named a Leader in the IDC MarketScape for XDR",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/02/microsoft-named-a-leader-in-the-idc-marketscape-for-xdr/",
    "description": "<p>Microsoft has been named a Leader in IDC’s inaugural category for Worldwide Extended Detection and Response (XDR) Software for 2025, recognized for its deep integration, intelligent automation, and unified security operations solutions.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/02/microsoft-named-a-leader-in-the-idc-marketscape-for-xdr/\">Microsoft named a Leader in the IDC MarketScape for XDR</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-02T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[Launched] Generally Available: New Health Check infrastructure for Azure Traffic Manager",
    "link": "https://azure.microsoft.com/updates?id=509097",
    "description": "Azure Traffic Manager has\r\nintroduced new health check infrastructure to improve the resiliency and\r\nscalability of the service. This infrastructure is now available, and customers\r\nare being moved onto the new infrastructure. The rollout of the new probing\r\n",
    "pubDate": "2025-10-02T16:36:44.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: MSSQL extension integration with Microsoft Fabric ",
    "link": "https://azure.microsoft.com/updates?id=503646",
    "description": "The MSSQL extension for Visual Studio Code (VS Code) now brings SQL database in Fabric directly into your development workflow. With the new Fabric connectivity option in the Connection Dialog, you can sign in using Microsoft Entra ID, browse your Fabric ",
    "pubDate": "2025-10-01T17:30:57.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Azure Machine Learning - Data labeling Deprecation",
    "link": "https://azure.microsoft.com/updates?id=501692",
    "description": "On September 30, 2026, Azure Machine data labeling will be retired. Please transition to 3rd party data labeling providers by 30 September 2026.  From today to September 30, 2026, you can continue to use data labelling without disruption. On September 30,",
    "pubDate": "2025-10-01T17:30:57.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Azure Network Policy Manager (NPM) for Linux nodes on AKS to Be Retired by September 30, 2028",
    "link": "https://azure.microsoft.com/updates?id=500268",
    "description": "On September 30, 2028, we’ll end support for Azure Network Policy Manager (NPM) on Linux nodes in AKS. To avoid disruptions, migrate AKS clusters running Linux nodes from NPM to Cilium Network Policy by that date.      Transitioning to Cilium Network Poli",
    "pubDate": "2025-10-01T17:15:18.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure SQL updates for late September 2025 ",
    "link": "https://azure.microsoft.com/updates?id=503612",
    "description": "In late September 2025, the following updates and enhancements were made to Azure SQL:  Protection from ransomware attacks to long-term retention (LTR) backups via immutability. Learn more. ",
    "pubDate": "2025-10-01T16:00:52.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Meet Microsoft 365 Premium: Your AI and productivity powerhouse",
    "link": "https://www.microsoft.com/en-us/microsoft-365/blog/2025/10/01/meet-microsoft-365-premium-your-ai-and-productivity-powerhouse/",
    "description": "<p>We’re taking a big step forward with major updates to our individual subscription plans, combining the best of AI and productivity at an unbeatable price.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog/2025/10/01/meet-microsoft-365-premium-your-ai-and-productivity-powerhouse/\">Meet Microsoft 365 Premium: Your AI and productivity powerhouse</a> appeared first on <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog\">Microsoft 365 Blog</a>.</p>\n",
    "pubDate": "2025-10-01T16:00:00.000Z",
    "source": "Microsoft 365"
  },
  {
    "title": "Cybersecurity Awareness Month: Security starts with you",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/01/cybersecurity-awareness-month-security-starts-with-you/",
    "description": "<p>At Microsoft, we believe that cybersecurity is as much about people as it is about technology. Explore some of our resources for Cybersecurity Awareness Month to stay safe online. </p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/01/cybersecurity-awareness-month-security-starts-with-you/\">Cybersecurity Awareness Month: Security starts with you</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-01T16:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[In preview] Public Preview: Soft Delete feature in Azure Compute Gallery",
    "link": "https://azure.microsoft.com/updates?id=506886",
    "description": "The Soft Delete feature in Azure Compute Gallery lets you recover accidentally deleted images within a 7-day retention period. This grace period gives users time to restore any images that were mistakenly deleted. Learn more.",
    "pubDate": "2025-09-30T19:30:35.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Support for Service Connector (preview) on Azure Container Apps will end on March 30th, 2026",
    "link": "https://azure.microsoft.com/updates?id=501528",
    "description": "Support for Service Connector (preview) on Azure Container Apps will end on March 30, 2026. After this date, Service Connector (preview) will no longer be supported on Azure Container Apps. If you created service connections using the Azure Portal, your e",
    "pubDate": "2025-09-30T17:30:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: NVv4-series Azure Virtual Machines will be retired on September 30, 2026",
    "link": "https://azure.microsoft.com/updates?id=500578",
    "description": "On September 30, 2026, Microsoft Azure will retire the Standard_NV4as_v4, Standard_NV4ahs_v4,Standard_NV8as_v4, Standard_NV8ahs_v4,Standard_NV16as_v4, Standard_NV16ahs_v4, Standard_NV32as_v4, and Standard_NV32ahs_v4 virtual machines (VMs) in the NVv4-seri",
    "pubDate": "2025-09-30T17:15:32.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Spark Native Connector for Semantic Link ",
    "link": "https://azure.microsoft.com/updates?id=502602",
    "description": "Starting October 1, 2025, the Spark native connector will be officially retired. This decision is based on internal analysis indicating low usage, high maintenance costs, and potential security vulnerabilities. To ensure continued support and improved sec",
    "pubDate": "2025-09-30T13:45:49.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Empowering defenders in the era of agentic AI with Microsoft Sentinel",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/09/30/empowering-defenders-in-the-era-of-agentic-ai-with-microsoft-sentinel/",
    "description": "<p>Microsoft Sentinel is expanding into an agentic platform with general availability of the Sentinel data lake, and the public preview of Sentinel graph and Sentinel Model Context Protocol (MCP) server. </p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/09/30/empowering-defenders-in-the-era-of-agentic-ai-with-microsoft-sentinel/\">Empowering defenders in the era of agentic AI with Microsoft Sentinel</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-09-30T13:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "WordPress on Azure Kubernetes Service",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/infrastructure/wordpress-container",
    "description": "Use Azure Kubernetes Service (AKS) to deploy a highly scalable and secure installation of WordPress for large, storage-intensive applications.",
    "pubDate": "2025-09-29T22:05:36.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[Launched] Generally Available: Visualize New Azure Resource Manager Metrics through Azure Monitor",
    "link": "https://azure.microsoft.com/updates?id=506317",
    "description": "We are announcing that Azure Resource Manager now offers enhanced integration with Azure Monitor Metrics for your subscriptions! You can now have deeper visibility and more granular monitoring capabilities for your Resource Manager operations.You can acce",
    "pubDate": "2025-09-29T15:30:44.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Vibe working: Introducing Agent Mode and Office Agent in Microsoft 365 Copilot",
    "link": "https://www.microsoft.com/en-us/microsoft-365/blog/2025/09/29/vibe-working-introducing-agent-mode-and-office-agent-in-microsoft-365-copilot/",
    "description": "<p>Today, we're bringing vibe working to Microsoft 365 Copilot with Agent Mode in Office apps and Office Agent in Copilot chat.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog/2025/09/29/vibe-working-introducing-agent-mode-and-office-agent-in-microsoft-365-copilot/\">Vibe working: Introducing Agent Mode and Office Agent in Microsoft 365 Copilot</a> appeared first on <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog\">Microsoft 365 Blog</a>.</p>\n",
    "pubDate": "2025-09-29T13:30:44.000Z",
    "source": "Microsoft 365"
  },
  {
    "title": "Azure VMware Solution AV36 Node Retirement on June 30, 2028",
    "link": "https://azure.microsoft.com/updates?id=503883",
    "description": "Microsoft is announcing the retirement of the AV36 node type\r\non June 30, 2028. The terms of your current AV36 Reserved Instance (RI) are\r\nnot affected by this announcement. At this time, we recommend that you review your current AV36\r\nRI expiration timeline",
    "pubDate": "2025-09-27T00:30:39.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Entity Linking from Azure AI Language",
    "link": "https://azure.microsoft.com/updates?id=499851",
    "description": "Microsoft\r\nis announcing the planned retirement of Entity Linking from Azure AI Language. We\r\nrecommend considering a replacement solution; Named\r\nEntity Recognition from Azure AI Language also supports entity\r\nidentification. Microsoft\r\nwill provide full supp",
    "pubDate": "2025-09-26T22:00:37.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: The Linux Consumption hosting plan of Azure Functions will be retired on September 30, 2028. Migrate to Flex Consumption.",
    "link": "https://azure.microsoft.com/updates?id=499451",
    "description": "The Azure Functions Linux Consumption hosting plan is being retired. Customers are advised to migrate to the Flex Consumption plan, which offers faster scaling, advanced networking, cold start mitigation, and concurrency control. To identify affected reso",
    "pubDate": "2025-09-26T16:30:29.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Upgrade BlobFuse v1 to latest version of Blobfuse v2 ",
    "link": "https://azure.microsoft.com/updates?id=498563",
    "description": "We recommend upgrading from BlobFuse v1 to BlobFuse\r\nv2,as all future enhancements and innovations related to Azure Blob Storage file system access will be focused exclusively on BlobFuse v2. Please note that support for BlobFuse v1 will be discontinued ef",
    "pubDate": "2025-09-26T16:00:55.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Build and Deploy Custom Document Processing Models on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/ai-ml/architecture/build-deploy-custom-models",
    "description": "Learn more about Azure options for orchestrating, storing, building, deploying, and using custom document processing models.",
    "pubDate": "2025-09-26T15:30:28.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Retirement: Azure App Service on Azure Arc enabled Kubernetes",
    "link": "https://azure.microsoft.com/updates?id=500016",
    "description": "Beginning on September 30th 2025, Azure App Service on Azure Arc enabled Kubernetes will be retired, and customers will no longer be able to install the extension.To continue to host your application workloads, we request you migrate to other solutions su",
    "pubDate": "2025-09-26T11:45:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Design Principles for Azure Applications",
    "link": "https://learn.microsoft.com/azure/architecture/guide/design-principles",
    "description": "Learn key design principles for Azure applications, including self-healing, redundancy, scaling, partitioning, and using managed services effectively.",
    "pubDate": "2025-09-25T19:17:12.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Design a Microservices Architecture",
    "link": "https://learn.microsoft.com/azure/architecture/microservices/design",
    "description": "Learn how to design and build a microservices architecture on Azure by following a reference implementation that illustrates best practices.",
    "pubDate": "2025-09-25T19:15:10.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[Launched] Generally Available: Azure NetApp Files Flexible service level",
    "link": "https://azure.microsoft.com/updates?id=503687",
    "description": "Flexible service level allows you to independently configure storage capacity and throughput, optimizing costs and performance by right-sizing based on your needs. This new service level avoids overprovisioning by supporting a customizable throughput whic",
    "pubDate": "2025-09-25T17:00:08.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Introducing Microsoft Marketplace — Thousands of solutions. Millions of customers. One Marketplace.",
    "link": "https://blogs.microsoft.com/blog/2025/09/25/introducing-microsoft-marketplace-thousands-of-solutions-millions-of-customers-one-marketplace/",
    "description": "<p>A new breed of industry-leading company is taking shape — Frontier Firms. These organizations blend human ambition with AI-powered technology to reshape how innovation is scaled, work is orchestrated and value is created. They’re accelerating AI transformation to enrich employee experiences, reinvent customer engagement, reshape business processes and unlock creativity and innovation.</p>\n<p>The post <a href=\"https://blogs.microsoft.com/blog/2025/09/25/introducing-microsoft-marketplace-thousands-of-solutions-millions-of-customers-one-marketplace/\">Introducing Microsoft Marketplace — Thousands of solutions. Millions of customers. One Marketplace.</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-09-25T16:03:19.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Introducing Microsoft Marketplace — Thousands of solutions. Millions of customers. One Marketplace.",
    "link": "https://blogs.microsoft.com/blog/2025/09/25/introducing-microsoft-marketplace-thousands-of-solutions-millions-of-customers-one-marketplace/",
    "description": "<p>To empower customers in becoming Frontier, we’re excited to announce the launch of the reimagined Microsoft Marketplace, your trusted source for cloud solutions, AI apps and agents.</p>\n<p>The post <a href=\"https://blogs.microsoft.com/blog/2025/09/25/introducing-microsoft-marketplace-thousands-of-solutions-millions-of-customers-one-marketplace/\">Introducing Microsoft Marketplace — Thousands of solutions. Millions of customers. One Marketplace.</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-09-25T15:47:32.000Z",
    "source": "Security"
  },
  {
    "title": "XCSSET evolves again: Analyzing the latest updates to XCSSET’s inventory",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/09/25/xcsset-evolves-again-analyzing-the-latest-updates-to-xcssets-inventory/",
    "description": "<p>Microsoft Threat Intelligence has uncovered a new variant of the XCSSET malware, which is designed to infect Xcode projects, typically used by software developers building Apple or macOS-related applications. </p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/09/25/xcsset-evolves-again-analyzing-the-latest-updates-to-xcssets-inventory/\">XCSSET evolves again: Analyzing the latest updates to XCSSET’s inventory</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-09-25T15:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "Empower your workforce with agents in Microsoft 365 Copilot",
    "link": "https://www.microsoft.com/en-us/microsoft-cloud/blog/2025/09/25/empower-your-workforce-with-agents-in-microsoft-365-copilot/",
    "description": "<p>We're announcing the launch of the Microsoft Marketplace, a unified web destination to find, try, and buy our full catalog of cloud solutions, AI apps, and agents.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/microsoft-cloud/blog/2025/09/25/empower-your-workforce-with-agents-in-microsoft-365-copilot/\">Empower your workforce with agents in Microsoft 365 Copilot</a> appeared first on <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog\">Microsoft 365 Blog</a>.</p>\n",
    "pubDate": "2025-09-25T14:00:00.000Z",
    "source": "Microsoft 365"
  },
  {
    "title": "Retirement: The Insights blade in AKS is now called Monitor",
    "link": "https://azure.microsoft.com/updates?id=497368",
    "description": "The Insights blade in AKS has been renamed to Monitor and relocated\r\nfrom the Monitoring section to the top level of the table of contents for\r\nincreased visibility. You’ll continue to have access to the same monitoring\r\ndata and features—there are no change",
    "pubDate": "2025-09-25T12:00:02.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Discover and assess PostgreSQL in Azure Migrate ",
    "link": "https://azure.microsoft.com/updates?id=503641",
    "description": "Planning the next move for your PostgreSQL workloads just got easier. Azure Migrate now enables you to discover and assess PostgreSQL resources across VMware, Hyper‑V, physical servers, and other cloud environments. Azure Migrate provides a centralized hu",
    "pubDate": "2025-09-24T17:00:24.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Delete on-demand backup in Azure DB for MySQL - Flexible Server ",
    "link": "https://azure.microsoft.com/updates?id=503622",
    "description": "You can now manually trigger on-demand backups in Azure DB for MySQL - Flexible Server instead of solely relying on the system-initiated automated backups and schedule. As part of August 2025 release, you can delete on-demand backups that are no longer ne",
    "pubDate": "2025-09-24T17:00:24.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retail at risk: How one alert uncovered a persistent cyberthreat​​",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/09/24/retail-at-risk-how-one-alert-uncovered-a-persistent-cyberthreat/",
    "description": "<p>In the latest edition of our Cyberattack Series, we dive into real-world cases targeting retail organizations. With 60% of retail companies reporting operational disruptions from cyberattacks and 43% experiencing breaches in the past year, the stakes have never been higher. This post unpacks where a single alert led to the discovery of a major persistent threat, how attackers exploited unpatched SharePoint vulnerabilities and compromised identities to infiltrate networks—and how the Microsoft Incident Response—the Detection and Response Team (DART) swiftly stepped in with forensic insights and actionable guidance. Download the full report to learn more about how one small signal exposed a much larger danger, and how you can strengthen your defenses against similar threats.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/09/24/retail-at-risk-how-one-alert-uncovered-a-persistent-cyberthreat/\">Retail at risk: How one alert uncovered a persistent cyberthreat​​</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-09-24T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "Agent Factory: Designing the open agentic web stack",
    "link": "https://azure.microsoft.com/en-us/blog/agent-factory-designing-the-open-agentic-web-stack/",
    "description": "<p>Unlock enterprise value with an open, secure, and interoperable AI agent ecosystem.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/agent-factory-designing-the-open-agentic-web-stack/\">Agent Factory: Designing the open agentic web stack</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-09-24T15:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Expanding model choice in Microsoft 365 Copilot",
    "link": "https://www.microsoft.com/en-us/microsoft-365/blog/2025/09/24/expanding-model-choice-in-microsoft-365-copilot/",
    "description": "<p>We’re excited to announce that we’re expanding the models that power Microsoft 365 Copilot with the addition of Anthropic models.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog/2025/09/24/expanding-model-choice-in-microsoft-365-copilot/\">Expanding model choice in Microsoft 365 Copilot</a> appeared first on <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog\">Microsoft 365 Blog</a>.</p>\n",
    "pubDate": "2025-09-24T15:00:00.000Z",
    "source": "Microsoft 365"
  },
  {
    "title": "AI vs. AI: Detecting an AI-obfuscated phishing campaign",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/09/24/ai-vs-ai-detecting-an-ai-obfuscated-phishing-campaign/",
    "description": "<p>Microsoft Threat Intelligence recently detected and blocked a credential phishing campaign that likely used AI-generated code to obfuscate its payload and evade traditional defenses, demonstrating a broader trend of attackers leveraging AI to increase the effectiveness of their operations and underscoring the need for defenders to understand and anticipate AI-driven threats.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/09/24/ai-vs-ai-detecting-an-ai-obfuscated-phishing-campaign/\">AI vs. AI: Detecting an AI-obfuscated phishing campaign</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-09-24T12:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "Retirement: Azure Disk Encryption",
    "link": "https://azure.microsoft.com/updates?id=493779",
    "description": "Azure\r\nDisk Encryption will be retired on September 15, 2028 and we recommend you transition to Encryption\r\nat Host by that date.   Alternate disk encryption solutions such as\r\nEncryption At Host and CVM OS disk encryption offer broader operating system\r\nsupp",
    "pubDate": "2025-09-24T11:45:14.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Site Recovery Support for Virtual Machines with Premium SSD v2 disks",
    "link": "https://azure.microsoft.com/updates?id=502998",
    "description": "Announcing the General Availability of Azure Site Recovery (ASR) for Virtual Machines with Premium SSD v2 disks. ASR provides seamless disaster recovery for Virtual Machines across Azure Regions and from on-premises to Azure, helping organizations maintai",
    "pubDate": "2025-09-23T17:30:13.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Use Delphix for Data Masking in Azure Data Factory and Azure Synapse Analytics",
    "link": "https://learn.microsoft.com/azure/architecture/databases/guide/data-obfuscation-with-delphix-in-azure-data-factory",
    "description": "Learn how to use Delphix with Azure Data Factory and Azure Synapse Analytics to automate data masking, ensure compliance, and streamline secure data workflows.",
    "pubDate": "2025-09-23T16:42:51.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Scramble SAP Data by using Delphix and Azure Data Factory or Azure Synapse Analytics",
    "link": "https://learn.microsoft.com/azure/architecture/databases/guide/data-scrambling-for-sap-using-delphix-and-azure-data-factory",
    "description": "Learn about how to perform data scrambling for SAP applications by using Delphix and Azure Data Factory or Azure Synapse Analytics.",
    "pubDate": "2025-09-23T16:42:51.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Retirement: NVv3-series Azure Virtual Machines will be retired on September 30 ,2026",
    "link": "https://azure.microsoft.com/updates?id=500573",
    "description": "On September 30, 2026, Microsoft Azure will retire the Standard_NV12s_v3, Standard_NV12hs_v3, Standard_NV24s_v3, Standard_NV24ms_v3, Standard_NV32ms_v3, and Standard_NV48s_v3 virtual machines (VMs) in the NVv3-series virtual machines (VMs). To avoid any d",
    "pubDate": "2025-09-23T16:00:30.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Microsoft Purview delivered 30% reduction in data breach likelihood",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/09/23/microsoft-purview-delivered-30-reduction-in-data-breach-likelihood/",
    "description": "<p>A recent Total Economic Impact™ (TEI) Of Microsoft Purview study by Forrester Consulting, commissioned by Microsoft, offers valuable insights into how organizations are modernizing their data protection strategies. The study covers the tangible benefits of unifying data security, data governance and data compliance under a single platform—an approach exemplified by Microsoft Purview. </p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/09/23/microsoft-purview-delivered-30-reduction-in-data-breach-likelihood/\">Microsoft Purview delivered 30% reduction in data breach likelihood</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-09-23T16:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[Launched] Generally Available: GitHub Copilot app modernization capabilities for Java and .NET are now available",
    "link": "https://azure.microsoft.com/updates?id=503603",
    "description": "App modernization is essential for enterprises to stay\r\nsecure, scalable and innovative—but traditionally it requires a lot of effort\r\nthat can be redundant and complex. With GitHub Copilot app modernization,\r\ndevelopers can now stay focused on innovation wh",
    "pubDate": "2025-09-23T15:00:40.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "How Azure Cobalt 100 VMs are powering real-world solutions, delivering performance and efficiency results",
    "link": "https://azure.microsoft.com/en-us/blog/how-azure-cobalt-100-vms-are-powering-real-world-solutions-delivering-performance-and-efficiency-results/",
    "description": "<p>Cobalt 100 systems are designed to deliver high performance, energy efficiency, and cost effectiveness for a wide range of workloads.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/how-azure-cobalt-100-vms-are-powering-real-world-solutions-delivering-performance-and-efficiency-results/\">How Azure Cobalt 100 VMs are powering real-world solutions, delivering performance and efficiency results</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-09-23T15:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Accelerate migration and modernization with agentic AI",
    "link": "https://azure.microsoft.com/en-us/blog/accelerate-migration-and-modernization-with-agentic-ai/",
    "description": "<p>At the Migrate and Modernize Summit, we’re announcing a comprehensive set of agentic AI solutions and offerings to accelerate transformation and reduce friction.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/accelerate-migration-and-modernization-with-agentic-ai/\">Accelerate migration and modernization with agentic AI</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-09-23T13:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Understand Data Models",
    "link": "https://learn.microsoft.com/azure/architecture/data-guide/technology-choices/understand-data-store-models",
    "description": "Learn how to evaluate Azure data store models based on workload patterns, scale, consistency, and governance to guide service selection.",
    "pubDate": "2025-09-22T17:58:53.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Prepare to Choose a Data Store in Azure",
    "link": "https://learn.microsoft.com/azure/architecture/guide/technology-choices/data-stores-getting-started",
    "description": "Learn how to choose the right Azure data store for your workloads by evaluating functional, performance, cost, and security requirements.",
    "pubDate": "2025-09-22T17:58:53.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Application design considerations for mission-critical workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-app-design",
    "description": "Learn how to implement a mission-critical workload that users access over a public endpoint without extra dependencies to other company resources.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Application platform considerations for mission-critical workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-app-platform",
    "description": "Reference architecture for a workload that is accessed over a public endpoint without additional dependencies to other company resources - App Platform.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Data platform for mission-critical workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-data-platform",
    "description": "Data decisions for the architecture of a mission-critical workload on Azure.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Deployment and testing for mission-critical workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-deploy-test",
    "description": "Reference architecture for a workload that is accessed over a public endpoint without extra dependencies to other company resources - Deployment and Testing.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Health modeling for mission-critical workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-health-modeling",
    "description": "Reference architecture for a workload that is accessed over a public endpoint without extra dependencies to other company resources - Health modeling.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Mission-critical architecture on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-intro",
    "description": "Architecture design for a highly reliable workload.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Networking and connectivity for mission-critical workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-networking",
    "description": "Networking decisions for the architecture of a mission-critical workload on Azure.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Operations for mission-critical workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-operations",
    "description": "Guidance for operations for the architecture of a mission-critical workload on Azure.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Security Considerations for Mission-Critical Workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-mission-critical/mission-critical-security",
    "description": "Learn about the security considerations for a workload that's accessed over a public endpoint without dependencies on other company resources.",
    "pubDate": "2025-09-22T17:12:32.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[Launched] Generally Available: Using Server-sent events with Application Gateway",
    "link": "https://azure.microsoft.com/updates?id=503909",
    "description": "Azure Application Gateway supports use of Server-sent events in general\r\navailability, enabling real-time data streaming from server to client.\r\nServer-sent events utilize server push technology on a persistent HTTP\r\nconnection for seamless updates to the cl",
    "pubDate": "2025-09-22T17:00:22.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Use Azure Synapse Analytics for Near Real-Time Lakehouse Data Processing",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/data/real-time-lakehouse-data-processing",
    "description": "Use Azure Event Hubs, Azure Synapse Analytics, and Azure Data Lake Storage to create an end-to-end, near real-time data lakehouse data processing solution.",
    "pubDate": "2025-09-22T16:28:15.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[Launched] Generally Available: Vaulted backup for Azure Files (Premium)",
    "link": "https://azure.microsoft.com/updates?id=503806",
    "description": "Announcing the General availability of vaulted backup for Azure Files shares premium!  Azure Backup brings vaulted protection to Azure Files shares premium, to ensure business\r\ncontinuity and compliance, even in the face of accidental deletion, malicious\r\na",
    "pubDate": "2025-09-22T16:15:14.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Extract text from objects using Power Automate and AI Builder",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/ai/extract-object-text",
    "description": "Use AI Builder and Azure AI Document Intelligence in a Power Automate workflow to extract text from images, for indexing and retrieval.",
    "pubDate": "2025-09-19T20:28:14.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "IBM z/OS mainframe migration with Avanade AMT",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/avanade-amt-zos-migration",
    "description": "See how to use the Avanade Automated Migration Technology (AMT) framework to migrate IBM z/OS mainframe workloads to Azure.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Refactor mainframe architecture by using CloudFrame Renovate",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/cloudframe-renovate-mainframe-refactor",
    "description": "Refactor your mainframe architecture to Azure by using the CloudFrame Renovate code migration tool. Renovate migrates COBOL to Java.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Extend mainframe applications to Azure by using Verastream Host Integrator",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/extend-mainframe-applications",
    "description": "Extend your mainframe applications to Azure by using the Verastream Host Integrator (VHI). VHI simplifies mainframe and host-based application functionality into a web service.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Mainframe file and tape backup to Azure using Luminex",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/luminex-mainframe-file-tape-transfer",
    "description": "Use Luminex products to transfer mainframe file and tape data to and from Azure to meet backup, archival, and other business needs.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Migrate mainframe data tier to Azure with mLogica LIBER*IRIS",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/mainframe-data-replication-azure-data-platform",
    "description": "Find out how mLogica LIBER*IRIS provides a proven solution for bulk data migration from a mainframe to Azure for enterprise workloads.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Migrate Mainframe Data to Azure",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/mainframe-data-replication-azure-rdrs",
    "description": "Learn how to use RDRS, a mainframe data replication solution, to migrate data to and from multiple Azure data platform services.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Modernize Mainframe Workloads by using BMC AMI Cloud",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/mainframe-modernization-bmc-ami-cloud",
    "description": "Learn how to use BMC AMI Cloud to send mainframe data directly to Azure Blob Storage as part of a mainframe modernization migration.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Replicate Mainframe Data by using Precisely Connect",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/mainframe-replication-precisely-connect",
    "description": "Learn how to use Precisely Connect to migrate legacy mainframe and midrange systems to the Azure platform.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Micro Focus Enterprise Server on Azure VMs",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/micro-focus-server",
    "description": "Optimize, modernize, and streamline IBM z/OS mainframe applications by using Micro Focus Enterprise Server 6.0 on Azure VMs.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Migrate AIX workloads to Azure with Skytap",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/migrate-aix-workloads-to-azure-with-skytap",
    "description": "This example illustrates a migration of AIX logical partitions (LPARs) to Skytap on Azure.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Migrate IBM i series to Azure with Skytap",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/migrate-ibm-i-series-to-azure-with-skytap",
    "description": "This example architecture shows how to use the native IBM i backup and recovery services with Microsoft Azure components.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Modernize Mainframe and Midrange Data",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/modernize-mainframe-data-to-azure",
    "description": "Learn how to modernize IBM mainframe and midrange data. Use a data-first approach to migrate the data to scalable and more secure cloud storage on Azure.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Move archive data from mainframe systems to Azure",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/move-archive-data-mainframes",
    "description": "Learn about a reference architecture that shows how to move data from mainframe and midrange systems to Azure.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "High-volume batch transaction processing",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/process-batch-transactions",
    "description": "Use Azure Kubernetes Service (AKS) and Azure Service Bus to implement high-volume batch transaction processing.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Re-engineer IBM z/OS batch applications on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/reengineer-mainframe-batch-apps-azure",
    "description": "Use Azure services to re-engineer mainframe batch applications. This architecture change can reduce costs and improve scalability.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Refactor IBM z/TPF mainframe systems to Azure",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/refactor-ibm-ztpf-mainframe",
    "description": "Learn how to refactor IBM z/TPF mainframe systems to functionally equivalent systems on Microsoft Azure.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Refactor mainframe applications with Advanced",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/refactor-mainframe-applications-advanced",
    "description": "Learn how to use the Automated COBOL Refactoring solution from Advanced to modernize your mainframe COBOL applications, run them on Azure, and reduce costs.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Refactor mainframe applications with Astadia",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/refactor-mainframe-applications-astadia",
    "description": "See an architecture that uses Astadia to migrate COBOL applications from an on-premises environment to the cloud.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Rehost IMS DC and IMS DB on Azure by Using Raincode IMSql",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/rehost-ims-raincode-imsql",
    "description": "Learn how to rehost IBM IMS DC and IMS DB on Azure by using Raincode IMSql. Rehost seamlessly without translating or changing your application.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Rehost mainframe applications by using NTT DATA UniKix",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/rehost-mainframe-ntt-data-unikix",
    "description": "Improve efficiency and cut costs by running mainframe applications and workloads on Azure. Use UniKix software from NTT DATA to rehost legacy assets.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Replatform AIX workloads on Azure",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/mainframe/replatform-aix-workloads",
    "description": "Learn how to replatform AIX workloads on Azure to reduce your TCO, improve business agility, and improve operational resiliency.",
    "pubDate": "2025-09-19T19:20:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[In preview] Public Preview: Azure Kubernetes Fleet Manager – auto-upgrade target Kubernetes version channel ",
    "link": "https://azure.microsoft.com/updates?id=503240",
    "description": "Azure Kubernetes Fleet Manager has a new auto-upgrade channel that\r\nallows you to set a target Kubernetes minor version. Using this channel means\r\nclusters on the target Kubernetes minor continue to receive only patch updates\r\nuntil the minor reaches the end",
    "pubDate": "2025-09-19T17:30:11.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: High Scale mode for Azure Monitor – Container Insights ",
    "link": "https://azure.microsoft.com/updates?id=503034",
    "description": "Container Insights is Azure Monitor’s solution for collecting logs from your Azure Kubernetes Service clusters.   Announcing  the general availability of High scale mode in Container Insights to help customers achieve a higher log collection throughput fr",
    "pubDate": "2025-09-19T13:30:10.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Managed Service for Prometheus now includes native Grafana dashboards within the Azure portal",
    "link": "https://azure.microsoft.com/updates?id=503286",
    "description": "Announcing the Azure Managed Service for\r\nPrometheus now includes native Grafana dashboards within the Azure portal at no\r\nadditional cost. This integration marks a major milestone in our mission to\r\nsimplify observability reducing the administrative overhea",
    "pubDate": "2025-09-19T13:00:39.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Data Box Next Gen is now generally available in additional regions",
    "link": "https://azure.microsoft.com/updates?id=503350",
    "description": "Azure\r\nData Box Next Gen is now Generally Available in NEW regions including: India, Qatar, South Africa and Korea. With\r\nthis new addition, we now have:\r\n Both\r\n     Azure Data box 120TB and 525 TB generally available (GA) in the US, UK,\r\n     Europe, US Gov,",
    "pubDate": "2025-09-19T12:00:46.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "N-tier Architecture Style",
    "link": "https://learn.microsoft.com/azure/architecture/guide/architecture-styles/n-tier",
    "description": "Learn about the benefits, challenges, and best practices for N-tier architectures on Azure, which separates an app into logical layers and physical tiers.",
    "pubDate": "2025-09-18T21:38:30.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Use AI to Forecast Customer Orders",
    "link": "https://learn.microsoft.com/azure/architecture/ai-ml/idea/next-order-forecasting",
    "description": "Learn how to use AI and machine learning to forecast a customer's future order quantity for a specific SKU. See the Azure services that you can use in this solution.",
    "pubDate": "2025-09-18T21:25:09.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Retirement: Licensing changes for future Azure VMware Solution subscriptions starting October 16, 2025.",
    "link": "https://azure.microsoft.com/updates?id=503878",
    "description": "Broadcom\r\nannounced changes to their VMware licensing policies. The change now\r\nrequires new customers to bring their own portable VCF subscriptions when\r\nusing hyperscaler platforms. Our current Azure VMware Solution (AVS) customers\r\ncan continue to operate ",
    "pubDate": "2025-09-18T20:45:29.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: DCa/ECa v6 series AMD based confidential virtual machines (VMs) ",
    "link": "https://azure.microsoft.com/updates?id=502874",
    "description": "Microsoft is announcing the general availability of the new DCa/ECa v6 series AMD based confidential virtual machines (VMs) in the UAE North and Korea Central regions with 4th generation AMD EPYC™ processors. Featuring Secure Encrypted Virtualization – Se",
    "pubDate": "2025-09-18T19:00:07.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Azure Kubernetes Fleet Manager – update run approval gates",
    "link": "https://azure.microsoft.com/updates?id=503245",
    "description": "Azure Kubernetes\r\nFleet Manager update runs now support approval gates. Gates can be placed before and after update\r\ngroups and stages and provide additional control over the flow of the update\r\nrun. Gates allow you to either manually approve the update run ",
    "pubDate": "2025-09-18T17:30:18.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Distributed tracing for Durable Functions ",
    "link": "https://azure.microsoft.com/updates?id=503139",
    "description": "Distributed tracing V2 for Durable Functions introduces a robust and comprehensive\r\ntracing model that enables developers to correlate operations in\r\norchestrations, activities, and durable entities. This capability is particularly\r\nuseful for Durable Functi",
    "pubDate": "2025-09-18T17:00:27.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Microsoft Defender delivered 242% return on investment over three years​​",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/09/18/microsoft-defender-delivered-242-return-on-investment-over-three-years/",
    "description": "<p>​The latest 2025 commissioned Forrester Consulting Total Economic Impact™ (TEI) study reveals a 242% ROI over three years for organizations that chose Microsoft Defender. It helps security leaders consolidate tools, reduce overhead, and empower their SecOps teams with operational efficiencies powered by AI and automation. In total, the study found Defender delivered $17.8 million in benefits and paid for itself in less than six months. ​</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/09/18/microsoft-defender-delivered-242-return-on-investment-over-three-years/\">Microsoft Defender delivered 242% return on investment over three years​​</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-09-18T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "Microsoft 365 Copilot: Enabling human-agent teams",
    "link": "https://www.microsoft.com/en-us/microsoft-365/blog/2025/09/18/microsoft-365-copilot-enabling-human-agent-teams/",
    "description": "<p>Microsoft 365 Copilot introduces AI agents that support teamwork—helping groups plan, meet, and communicate more effectively across Teams, SharePoint, and Viva Engage.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog/2025/09/18/microsoft-365-copilot-enabling-human-agent-teams/\">Microsoft 365 Copilot: Enabling human-agent teams</a> appeared first on <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog\">Microsoft 365 Blog</a>.</p>\n",
    "pubDate": "2025-09-18T16:00:00.000Z",
    "source": "Microsoft 365"
  },
  {
    "title": "Inside the world’s most powerful AI datacenter",
    "link": "https://blogs.microsoft.com/blog/2025/09/18/inside-the-worlds-most-powerful-ai-datacenter/",
    "description": "<p>Today in Wisconsin we introduced Fairwater, our newest US AI datacenter, the largest and most sophisticated AI factory we’ve built yet. In addition to our Fairwater datacenter in Wisconsin, we also have multiple identical Fairwater datacenters under construction in other locations across the US.</p>\n<p>The post <a href=\"https://blogs.microsoft.com/blog/2025/09/18/inside-the-worlds-most-powerful-ai-datacenter/\">Inside the world’s most powerful AI datacenter</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-09-18T15:45:10.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Microsoft named a Leader in the 2025 Gartner® Magic Quadrant™ for Global Industrial IoT Platforms ",
    "link": "https://azure.microsoft.com/en-us/blog/microsoft-named-a-leader-in-the-2025-gartner-magic-quadrant-for-global-industrial-iot-platforms/",
    "description": "<p>Microsoft has been named a Leader in the 2025 Gartner Magic Quadrant for Global Industrial IoT Platforms, highlighting its commitment to delivering intelligent, secure, and scalable industrial solutions with Azure. </p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/microsoft-named-a-leader-in-the-2025-gartner-magic-quadrant-for-global-industrial-iot-platforms/\">Microsoft named a Leader in the 2025 Gartner® Magic Quadrant™ for Global Industrial IoT Platforms </a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-09-18T15:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Guidance for using Azure Key Vault in a multitenant solution",
    "link": "https://learn.microsoft.com/azure/architecture/guide/multitenant/service/key-vault",
    "description": "This article describes the features of Azure Key Vault that are useful when you work with multitenanted systems, and it provides links to guidance for how to use Azure Key Vault in a multitenant solution.",
    "pubDate": "2025-09-17T22:27:44.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Agent Factory: Creating a blueprint for safe and secure AI agents",
    "link": "https://azure.microsoft.com/en-us/blog/agent-factory-creating-a-blueprint-for-safe-and-secure-ai-agents/",
    "description": "<p>Azure AI Foundry brings together security, safety, and governance in a layered process enterprises can follow to build trust in their agents.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/agent-factory-creating-a-blueprint-for-safe-and-secure-ai-agents/\">Agent Factory: Creating a blueprint for safe and secure AI agents</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-09-17T21:30:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "[In preview] Public Preview: Azure Functions .NET 10 support ",
    "link": "https://azure.microsoft.com/updates?id=503134",
    "description": "Azure Functions now supports .NET 10 in Public Preview. To use\r\n.NET 10, adjust the target framework in your Functions project, and update\r\nreferences to Microsoft.Azure.Functions.Worker.Sdk to version 2.0.5 or later. .NET 10 projects can be deployed to app",
    "pubDate": "2025-09-17T17:15:04.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Introducing the new Network Security Hub experience",
    "link": "https://azure.microsoft.com/updates?id=503617",
    "description": "The Azure Firewall Manager\r\nexperience has been expanded and rebranded as the Network Security Hub—a\r\ncentralized interface that brings together Azure Firewall, Web\r\nApplication Firewall (WAF), and DDoS Protection. This change is part\r\nof a broader effort to ",
    "pubDate": "2025-09-17T16:30:45.000Z",
    "source": "Azure Updates"
  }
]