[
  {
    "title": "​​Learn what generative AI can do for your security operations center",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/11/04/learn-what-generative-ai-can-do-for-your-security-operations-center-soc/",
    "description": "<p>This new e-book showcases what generative AI can do for your SOC, from reducing alert fatigue and enabling quicker triage to getting ahead of cyberattacks with proactive threat hunting, and more.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/11/04/learn-what-generative-ai-can-do-for-your-security-operations-center-soc/\">​​Learn what generative AI can do for your security operations center</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-11-04T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[In preview] Public Preview: Azure NetApp Files Object REST API ",
    "link": "https://azure.microsoft.com/updates?id=516643",
    "description": "The Object REST API, an S3-compatible REST API, on Azure NetApp Files bridges the gap between traditional file-based storage and modern cloud services, enabling customers to use their existing data in new ways. By providing integration via Microsoft Fabri",
    "pubDate": "2025-11-03T17:30:04.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "SesameOp: Novel backdoor uses OpenAI Assistants API for command and control",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/11/03/sesameop-novel-backdoor-uses-openai-assistants-api-for-command-and-control/",
    "description": "<p>Microsoft Incident Response – Detection and Response Team (DART) researchers uncovered a new backdoor that is notable for its novel use of the OpenAI Assistants Application Programming Interface (API) as a mechanism for command-and-control (C2) communications. Instead of relying on more traditional methods, the threat actor behind this backdoor abuses OpenAI as a C2 channel as a way to stealthily communicate and orchestrate malicious activities within the compromised environment. To do this, a component of the backdoor uses the OpenAI Assistants API as a storage or relay mechanism to fetch commands and run tasks for the threat actor.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/11/03/sesameop-novel-backdoor-uses-openai-assistants-api-for-command-and-control/\">SesameOp: Novel backdoor uses OpenAI Assistants API for command and control</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-11-03T17:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[In preview] Public Preview: Azure Functions zero-downtime deployments with rolling updates in Flex Consumption",
    "link": "https://azure.microsoft.com/updates?id=520822",
    "description": "Azure Functions now supports rolling updates in the Flex Consumption plan, delivering zero-downtime deployments with a simple configuration change.  Instead of forcefully restarting all instances during code or configuration updates, the platform graceful",
    "pubDate": "2025-10-30T18:00:45.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "The 5 generative AI security threats you need to know about detailed in new e-book",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/30/the-5-generative-ai-security-threats-you-need-to-know-about-detailed-in-new-e-book/",
    "description": "<p>In this blog post, we’ll highlight the key themes covered in the e-book, including the challenges organizations face, the top generative AI threats to organizations, and how companies can enhance their security posture to meet the dangers of today’s unpredictable AI environments.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/30/the-5-generative-ai-security-threats-you-need-to-know-about-detailed-in-new-e-book/\">The 5 generative AI security threats you need to know about detailed in new e-book</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-30T18:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[Launched] Generally Available: High Scale Private Endpoints  ",
    "link": "https://azure.microsoft.com/updates?id=522813",
    "description": "You can now increase Azure Private Endpoint’s virtual network (VNet) limits by upgrading to High Scale Private Endpoints (HSPE). Today local VNet limits are restricted to 1,000 private endpoints per Virtual Network. Any attempts to create additional endpo",
    "pubDate": "2025-10-30T16:30:43.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Instant Access Snapshots for Azure Premium SSD v2 and Ultra Disks Storage",
    "link": "https://azure.microsoft.com/updates?id=520805",
    "description": "Announcing the Public Preview of Instant Access Snapshots\r\nfor Premium SSD v2 (Pv2) and Ultra Disks. This new capability enables you\r\nto restore new disks immediately after creating snapshots of Pv2 and Ultra\r\ndisks. Restore disks deliver high performance in",
    "pubDate": "2025-10-30T16:00:54.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Support for Node.js 20 ends on April 30, 2026 – upgrade your apps to Node.js 22 ",
    "link": "https://azure.microsoft.com/updates?id=502957",
    "description": "In alignment with the end of community\r\nsupport, on April 30, 2026, support for Node.js 20 in Azure Functions will end.\r\nYour apps that are hosted on Functions will continue to run, but security\r\nupdates and performance optimizations will no longer be availa",
    "pubDate": "2025-10-30T16:00:54.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Remove dependency on these preview features before March 31, 2026 ",
    "link": "https://azure.microsoft.com/updates?id=501663",
    "description": "On March 31, 2026, the following preview features will be retired:  Group multiple steps as a whole to better organize complex pipelines  Compare pipeline jobs to debug failures or unexpected issues  Import data into a data labelling project  Use v2 data ",
    "pubDate": "2025-10-29T21:00:13.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Signed request on Azure Front Door ",
    "link": "https://azure.microsoft.com/updates?id=501169",
    "description": "We’re announcing the public preview of Azure Front Door signed request, a powerful new feature designed to enhance access control for content delivery. This capability allows organizations to restrict access to their content—such as media streams, file do",
    "pubDate": "2025-10-28T18:00:34.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure WAF CAPTCHA Challenge for Azure Front Door ",
    "link": "https://azure.microsoft.com/updates?id=512751",
    "description": "Announcing the General Availability of CAPTCHA for Azure Web Application Firewall (WAF) with Azure Front Door.Modern web applications face evolving threats, including bots, web scrapers, and brute-force attacks, many of which can bypass traditional securi",
    "pubDate": "2025-10-28T16:45:07.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generaly Available: Azure Sphere OS version 25.10 is now available for evaluation",
    "link": "https://azure.microsoft.com/updates?id=519310",
    "description": "Azure Sphere OS version 25.10 is now available for evaluation in the Retail Eval feed. The retail evaluation period for this release provides 14 days (about 2 weeks) of testing. During this time, please verify that your applications and devices operate pr",
    "pubDate": "2025-10-28T14:15:20.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Storage Mover support for NFS source to Azure File Share (NFS 4.1) target",
    "link": "https://azure.microsoft.com/updates?id=514658",
    "description": "Azure Storage Mover can now migrate your NFS File shares to Azure File Shares (NFS 4.1). Storage Mover is a fully managed migration service that enables you to migrate on-premises files and folders to Azure Storage while minimizing downtime for your workl",
    "pubDate": "2025-10-27T18:45:01.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: PgBouncer 1.23.1 support in Azure Database for PostgreSQL – Flexible Server ",
    "link": "https://azure.microsoft.com/updates?id=513254",
    "description": "PgBouncer 1.23.1 is now generally available in Azure Database for PostgreSQL – Flexible Server. As a built-in connection pooling feature, PgBouncer helps you scale to thousands of connections with low overhead by efficiently managing idle and short-lived ",
    "pubDate": "2025-10-27T18:30:05.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: RHEL Software Reservations Now Available on Azure with Updated Pricing",
    "link": "https://azure.microsoft.com/updates?id=519526",
    "description": "Red Hat\r\nEnterprise Linux (RHEL) software reservations are now available again for\r\npurchase on Azure following important updates to billing meters and pricing.\r\nThis update addresses issues with previous billing meters and aligns with Red\r\nHat's new pricing ",
    "pubDate": "2025-10-27T16:45:57.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Fully managed cloud-to-cloud transfers with Azure Storage Mover",
    "link": "https://azure.microsoft.com/en-us/blog/fully-managed-cloud-to-cloud-transfers-with-azure-storage-mover/",
    "description": "<p>Move data from Files Shares and NAS Storage into Azure Object and File storage with minimal disruption.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/fully-managed-cloud-to-cloud-transfers-with-azure-storage-mover/\">Fully managed cloud-to-cloud transfers with Azure Storage Mover</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-23T16:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Harden your identity defense with improved protection, deeper correlation, and richer context",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/23/harden-your-identity-defense-with-improved-protection-deeper-correlation-and-richer-context/",
    "description": "<p>Expanded ITDR features—including the new Microsoft Defender for Identity sensor, now generally available—bring improved protection, correlation, and context to help customers modernize their identity defense. </p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/23/harden-your-identity-defense-with-improved-protection-deeper-correlation-and-richer-context/\">Harden your identity defense with improved protection, deeper correlation, and richer context</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-23T16:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "Retirement: Azure Computer Vision – Image Analysis will be retired on September 25, 2028 ",
    "link": "https://azure.microsoft.com/updates?id=502909",
    "description": "Microsoft is announcing the planned retirement of the Azure Computer Vision – Image Analysis service. \t Microsoft will provide full support for all existing Azure Computer Vision – Image Analysis customers until 9/25/2028. During this support window, cust",
    "pubDate": "2025-10-23T14:15:03.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: VM vCore customization features disabling simultaneous multi-threading (SMT/HT) and constrained cores",
    "link": "https://azure.microsoft.com/updates?id=516990",
    "description": "Azure announces the public preview of VM Customization\r\nfeatures, a new capability that gives customers greater control over virtual CPU\r\nconfigurations to optimize performance and licensing costs. This feature\r\nintroduces two powerful options: Disable Simul",
    "pubDate": "2025-10-22T17:15:22.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure SQL updates for mid-October 2025   ",
    "link": "https://azure.microsoft.com/updates?id=513240",
    "description": "In mid-October 2025, the following updates and enhancements were made to Azure SQL:   Improve the redirect connection type to require only port 1433 and promote to default. Learn more. Convert Azure SQL Database to Hyperscale while preserving existing geo",
    "pubDate": "2025-10-22T16:30:07.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Near-zero downtime scaling for HA-enabled Azure Database for PostgreSQL servers ",
    "link": "https://azure.microsoft.com/updates?id=502004",
    "description": "You can now scale your Azure Database for PostgreSQL servers that have high availability (HA) enabled with minimal impact to your users. The process usually takes less than 30 seconds, while traditional scaling can take 2 to 10 minutes. This new capabilit",
    "pubDate": "2025-10-22T16:00:32.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Microsoft named a Leader in the 2025 Gartner® Magic Quadrant™ for Distributed Hybrid Infrastructure",
    "link": "https://azure.microsoft.com/en-us/blog/microsoft-named-a-leader-in-the-2025-gartner-magic-quadrant-for-distributed-hybrid-infrastructure/",
    "description": "<p>We’re proud that Microsoft has once again been named a Leader in the 2025 Gartner® Magic Quadrant™ for Distributed Hybrid Infrastructure.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/microsoft-named-a-leader-in-the-2025-gartner-magic-quadrant-for-distributed-hybrid-infrastructure/\">Microsoft named a Leader in the 2025 Gartner® Magic Quadrant™ for Distributed Hybrid Infrastructure</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-22T16:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "The CISO imperative: Building resilience in an era of accelerated cyberthreats",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/22/the-ciso-imperative-building-resilience-in-an-era-of-accelerated-cyberthreats/",
    "description": "<p>The latest Microsoft Digital Defense Report 2025 paints a vivid picture of a cyberthreat landscape in flux. The surge in financially motivated cyberattacks and the persistent risk of nation-state actors demand urgent attention. But for those of us in the Office of the CISO, the real challenge, and opportunity, lies in how organizations respond, adapt, and build resilience for what comes next. </p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/22/the-ciso-imperative-building-resilience-in-an-era-of-accelerated-cyberthreats/\">The CISO imperative: Building resilience in an era of accelerated cyberthreats</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-22T16:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "The new Microsoft Security Store unites partners and innovation",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/21/the-new-microsoft-security-store-unites-partners-and-innovation/",
    "description": "<p>The Microsoft Security Store is the gateway for customers to easily discover, buy, and deploy trusted security solutions and AI agents from leading partners.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/21/the-new-microsoft-security-store-unites-partners-and-innovation/\">The new Microsoft Security Store unites partners and innovation</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-21T16:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "The Signals Loop: Fine-tuning for world-class AI apps and agents ",
    "link": "https://azure.microsoft.com/en-us/blog/the-signals-loop-fine-tuning-for-world-class-ai-apps-and-agents/",
    "description": "<p>Autonomous workflows, powered by real-time feedback and continuous learning, are becoming essential for productivity and decision-making.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/the-signals-loop-fine-tuning-for-world-class-ai-apps-and-agents/\">The Signals Loop: Fine-tuning for world-class AI apps and agents </a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-21T15:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "[Launched] Generally Available: Cloud-to-Cloud migration made simple with Azure Storage Mover",
    "link": "https://azure.microsoft.com/updates?id=514653",
    "description": "Azure Storage Mover’s new AWS S3 to Azure Blob migration feature\r\nis now generally available, empowering organizations to move data directly from\r\nAWS to Azure securely, reliably, and at scale. With this\r\nrelease, customers can eliminate manual pipelines and",
    "pubDate": "2025-10-20T21:00:03.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Open Source: Containerization Assist MCP Server ",
    "link": "https://azure.microsoft.com/updates?id=503268",
    "description": "Containerization Assist solves the\r\nchallenge of manual, error-prone containerization by automating Dockerfile creation\r\nand Kubernetes manifest generation. Unlike basic AI coding tools, it is a full\r\ncontainerization platform built on AKS Draft’s proven rea",
    "pubDate": "2025-10-20T21:00:03.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Sharing Capacity Reservation Groups",
    "link": "https://azure.microsoft.com/updates?id=516897",
    "description": "The ability to share Capacity Reservation\r\nGroups (CRGs) with subscriptions is now in Public Preview.  Previously, customers could deploy VMs in a Capacity\r\nReservation Group within the same subscription only. On-demand Capacity\r\nReservation Group (CRG) can ",
    "pubDate": "2025-10-20T17:15:20.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Enhanced cloning and Public IP retention scripts for Azure Application Gateway migration",
    "link": "https://azure.microsoft.com/updates?id=517027",
    "description": "Azure Application\r\nGateway introduces two new PowerShell scripts to simplify migration from V1\r\n(Standard or WAF) to V2 (Standard_V2 or WAF_V2) services.  As V1 SKUs’ is scheduled to retire by April 2026, we advise\r\nmigrating early and take advantage of Appl",
    "pubDate": "2025-10-20T17:00:28.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Innovation spotlight: How 3 customers are driving change with migration to Azure SQL",
    "link": "https://www.microsoft.com/en-us/sql-server/blog/2025/10/20/innovation-spotlight-how-3-customers-are-driving-change-with-migration-to-azure-sql/",
    "description": "<p>Learn how Microsoft Azure SQL Managed Instance helps organizations move from legacy constraints to a scalable and secure AI-ready foundation.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/sql-server/blog/2025/10/20/innovation-spotlight-how-3-customers-are-driving-change-with-migration-to-azure-sql/\">Innovation spotlight: How 3 customers are driving change with migration to Azure SQL</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-20T16:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Inside the attack chain: Threat activity targeting Azure Blob Storage",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/20/inside-the-attack-chain-threat-activity-targeting-azure-blob-storage/",
    "description": "<p>Azure Blob Storage is a high-value target for threat actors due to its critical role in storing and managing massive amounts of unstructured data at scale across diverse workloads and is increasingly targeted through sophisticated attack chains that exploit misconfigurations, exposed credentials, and evolving cloud tactics.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/20/inside-the-attack-chain-threat-activity-targeting-azure-blob-storage/\">Inside the attack chain: Threat activity targeting Azure Blob Storage</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-20T16:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[In development] Private Preview: New planned datacenter region in Malaysia (Southeast Asia 3)",
    "link": "https://azure.microsoft.com/updates?id=513752",
    "description": "Microsoft is expanding its digital infrastructure footprint further with a new datacenter region, Southeast Asia 3, planned in Malaysia. This datacenter region will feature Microsoft's most comprehensive and strategic cloud services, designed to support a",
    "pubDate": "2025-10-17T15:15:35.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: New OS SKU enum to migrate to Azure Linux 3.0 ",
    "link": "https://azure.microsoft.com/updates?id=512396",
    "description": "You can now\r\nmigrate to Azure Linux 3.0 with a new OS SKU enum, ‘AzureLinux3’, in Kubernetes\r\nversion 1.28-1.36.   This new\r\noption provides increased control over OS upgrades by decoupling them from Kubernetes\r\nupgrades. Customers using LTS version 1.28-1.31",
    "pubDate": "2025-10-17T15:15:35.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Functions support for Python 3.13 ",
    "link": "https://azure.microsoft.com/updates?id=512374",
    "description": "You can now\r\ndevelop functions using Python 3.13 locally and deploy them to Azure Functions.   Starting with\r\nPython 3.13, Functions introduces runtime version control, a new opt-in\r\nfeature that lets you target specific versions of the Functions Python runt",
    "pubDate": "2025-10-17T15:00:03.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Generative AI Operations for Organizations with MLOps Investments",
    "link": "https://learn.microsoft.com/azure/architecture/ai-ml/guide/genaiops-for-mlops",
    "description": "Extend existing MLOps investments to include generative AI operations. Learn where you can apply existing investments and where you need to extend those investments.",
    "pubDate": "2025-10-17T13:55:05.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Microsoft named a Leader in the 2025 Gartner® Magic Quadrant™ for SIEM",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/16/microsoft-named-a-leader-in-the-2025-gartner-magic-quadrant-for-siem/",
    "description": "<p>We’re honored to share that Microsoft has again been recognized as a Leader in the 2025 Gartner® Magic Quadrant™ for Security Information and Event Management (SIEM).</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/16/microsoft-named-a-leader-in-the-2025-gartner-magic-quadrant-for-siem/\">Microsoft named a Leader in the 2025 Gartner® Magic Quadrant™ for SIEM</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-16T18:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "[Launched] Generally Available: Prescaling in Azure Firewall ",
    "link": "https://azure.microsoft.com/updates?id=515452",
    "description": "Azure Firewall now supports prescaling, a feature that enables admins to provision and reserve capacity units in advance to handle expected traffic loads – such as seasonal peaks or planned business events. This helps to ensure consistent throughput, fast",
    "pubDate": "2025-10-16T16:15:32.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Confidential Containers preview on AKS is Closing Down",
    "link": "https://azure.microsoft.com/updates?id=502044",
    "description": "The public preview of Confidential Containers on AKS will be shutting down.This feature has been available in preview since 2023, and as part of our commitment to delivering secure and reliable services, we are streamlining our confidential computing offe",
    "pubDate": "2025-10-16T16:15:32.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Observed capacity metric in Azure Firewall ",
    "link": "https://azure.microsoft.com/updates?id=516002",
    "description": "Azure Firewall\r\nnow includes the observed capacity metric — a new observability signal designed\r\nto help administrators understand how their firewalls are scaling in practice.\r\nObserved capacity tracks the number of capacity units actively utilized over\r\ntime",
    "pubDate": "2025-10-16T16:00:55.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "From queries to conversations: Unlock insights about your data using Azure Storage Discovery—now generally available",
    "link": "https://azure.microsoft.com/en-us/blog/from-queries-to-conversations-unlock-insights-about-your-data-using-azure-storage-discovery-now-generally-available/",
    "description": "<p>We are excited to announce the general availability of Azure Storage Discovery.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/from-queries-to-conversations-unlock-insights-about-your-data-using-azure-storage-discovery-now-generally-available/\">From queries to conversations: Unlock insights about your data using Azure Storage Discovery—now generally available</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-16T15:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Extortion and ransomware drive over half of cyberattacks",
    "link": "https://blogs.microsoft.com/on-the-issues/2025/10/16/mddr-2025/",
    "description": "<p>In 80% of the cyber incidents Microsoft’s security teams investigated last year, attackers sought to steal data—a trend driven more by financial gain than intelligence gathering. </p>\n<p>The post <a href=\"https://blogs.microsoft.com/on-the-issues/2025/10/16/mddr-2025/\">Extortion and ransomware drive over half of cyberattacks</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-16T14:05:00.000Z",
    "source": "Security"
  },
  {
    "title": "[Launched] Generally Available: PowerShell, Az cmdlets, and Python SDK for Azure Database Migration Service  ",
    "link": "https://azure.microsoft.com/updates?id=500775",
    "description": "Announcing the general availability (GA) of automation support for Azure Database Migration Service (DMS) through PowerShell, custom cmdlets, and the Python SDK. Using Azure PowerShell Az.DataMigration or Azure CLI az datamigration, you can migrate databa",
    "pubDate": "2025-10-15T22:15:50.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Availability Zones and network restricted Key Vault and App Configuration references for Flex Consumption ",
    "link": "https://azure.microsoft.com/updates?id=512379",
    "description": "You can now enable\r\navailability zones for your Azure Functions Flex Consumption apps during both\r\ncreation and post-deployment. When enabled, instances are automatically\r\ndistributed across zones, enhancing reliability and fault tolerance. New Region\r\nSuppor",
    "pubDate": "2025-10-15T18:00:12.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Sora 2 now available in Azure AI Foundry",
    "link": "https://azure.microsoft.com/en-us/blog/sora-2-now-available-in-azure-ai-foundry/",
    "description": "<p>Turning imagination into reality has never been more possible—or more powerful—than it is today. With OpenAI’s Sora 2 now in public preview in Azure AI Foundry, organizations of all sizes can harness this advanced multimodal video generation model to accelerate innovation, drive engagement, and transform how ideas become compelling visual stories.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/sora-2-now-available-in-azure-ai-foundry/\">Sora 2 now available in Azure AI Foundry</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-15T18:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "[Launched] Generally Available: Azure Storage Discovery",
    "link": "https://azure.microsoft.com/updates?id=515479",
    "description": "Azure Storage Discovery provides enterprise-wide\r\nvisibility into your Azure Storage data estate. Insights that weren’t available before are now at\r\nyour fingertips. Deeply analyze\r\nused capacity and activity, optimize costs, enhance\r\nsecurity, and drive oper",
    "pubDate": "2025-10-15T17:00:38.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: SAP Business Data Cloud Connect to Azure Databricks",
    "link": "https://azure.microsoft.com/updates?id=511743",
    "description": "SAP Business Data Cloud (BDC) Connect to Azure Databricks is now generally available, enabling secure, bi-directional, zero-copy data sharing between SAP BDC and Azure Databricks using Delta Sharing, so teams can unify SAP and external data for analytics,",
    "pubDate": "2025-10-15T17:00:38.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Private Link Service Direct Connect",
    "link": "https://azure.microsoft.com/updates?id=503988",
    "description": "Azure\r\nPrivate Link service\r\nallows you to make your applications available to your customers privately and\r\nsecurely. The current setup procedure requires you to configure a private link\r\nservice and place applications behind a standard load balancer. Privat",
    "pubDate": "2025-10-15T17:00:38.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: The F, Fs, Fsv2, Lsv2, G, Gs, Av2, Amv2, and B series VMs are retiring in 2028",
    "link": "https://azure.microsoft.com/updates?id=500682",
    "description": "The F, Fs, Fsv2, Lsv2, G, Gs, Av2, Amv2, and B series of Azure Virtual Machines will retire on November 15th, 2028. These VMs will no longer be able to be used or purchased after this date.   To ensure any applications and workloads running on these VMs w",
    "pubDate": "2025-10-15T16:15:01.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Locations API Update for UK Azure Regions",
    "link": "https://azure.microsoft.com/updates?id=513376",
    "description": "To align with evolving compliance and regulatory requirements, Azure is updating the geographyGroup and regionalDisplayName metadata for UK-based regions in the Locations API.  These changes will take effect this month, October 2025, and will apply to the",
    "pubDate": "2025-10-15T16:00:24.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "The importance of hardening customer support tools against cyberattacks",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/10/15/the-importance-of-hardening-customer-support-tools-against-attack/",
    "description": "<p>As customer support tools become more connected and data-rich, they’re increasingly targeted by cyberattacks. Hardening these systems is no longer optional—it’s essential to protect customer trust, sensitive data, and business continuity.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/10/15/the-importance-of-hardening-customer-support-tools-against-attack/\">The importance of hardening customer support tools against cyberattacks</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>\n",
    "pubDate": "2025-10-15T16:00:00.000Z",
    "source": "Security"
  },
  {
    "title": "Use Azure Databricks to Orchestrate MLOps",
    "link": "https://learn.microsoft.com/azure/architecture/ai-ml/idea/orchestrate-machine-learning-azure-databricks",
    "description": "Learn about an approach for machine learning operations (MLOps) that uses Azure Databricks to run model training and batch scoring.",
    "pubDate": "2025-10-15T15:32:46.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "What’s new in Copilot Studio: September 2025",
    "link": "https://www.microsoft.com/en-us/microsoft-copilot/blog/copilot-studio/whats-new-in-copilot-studio-september-2025/",
    "description": "<p>In the September 2025 edition of our monthly roundup, we’re recapping the most exciting new features recently released in Microsoft Copilot Studio. </p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/microsoft-copilot/blog/copilot-studio/whats-new-in-copilot-studio-september-2025/\">What’s new in Copilot Studio: September 2025</a> appeared first on <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog\">Microsoft 365 Blog</a>.</p>\n",
    "pubDate": "2025-10-15T15:00:00.000Z",
    "source": "Microsoft 365"
  },
  {
    "title": "Global routing redundancy for mission-critical web applications",
    "link": "https://learn.microsoft.com/azure/architecture/guide/networking/global-web-applications/overview",
    "description": "Learn how to develop highly resilient global web applications.",
    "pubDate": "2025-10-15T09:00:46.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Use a gateway in front of multiple Azure OpenAI deployments or instances",
    "link": "https://learn.microsoft.com/azure/architecture/ai-ml/guide/azure-openai-gateway-multi-backend",
    "description": "Learn how to add a gateway in front of multiple Azure OpenAI model deployments or instances.",
    "pubDate": "2025-10-14T20:38:30.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Machine learning operations",
    "link": "https://learn.microsoft.com/azure/architecture/ai-ml/guide/machine-learning-operations-v2",
    "description": "Learn about a single deployable set of repeatable and maintainable patterns for creating machine learning CI/CD and retraining pipelines.",
    "pubDate": "2025-10-14T20:38:30.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[Launched] Generally Available: Azure Event Grid new capabilities ",
    "link": "https://azure.microsoft.com/updates?id=513855",
    "description": "Multiple new Azure Event Grid features have reached General Availability, supporting real-time\r\ntelemetry, automation, and hybrid workloads.Features now in General Availability:MQTT\r\nOAuth 2.0 Authentication Authenticate MQTT clients using JSON Web Tokens\r\n(",
    "pubDate": "2025-10-14T20:15:14.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Oracle Database@Azure offers new features, regions, and programs to unlock data and AI innovation",
    "link": "https://azure.microsoft.com/en-us/blog/oracle-databaseazure-offers-new-features-regions-and-programs-to-unlock-data-and-ai-innovation/",
    "description": "<p>Oracle Database@Azure adds new AI-ready features, expands to 33 regions, and launches new partner and migration programs</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/oracle-databaseazure-offers-new-features-regions-and-programs-to-unlock-data-and-ai-innovation/\">Oracle Database@Azure offers new features, regions, and programs to unlock data and AI innovation</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-14T18:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Databases architecture design",
    "link": "https://learn.microsoft.com/azure/architecture/databases/index",
    "description": "Learn about the different Azure database solutions described in Azure Architecture Center.",
    "pubDate": "2025-10-14T15:57:05.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Replicate and Sync Mainframe Data to Azure",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/migration/sync-mainframe-data-with-azure",
    "description": "Learn how to replicate data while you modernize mainframe and midrange systems. Sync on-premises data with Azure data during modernization.",
    "pubDate": "2025-10-14T15:21:19.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[Launched] Generally Available: Spot Placement Score ",
    "link": "https://azure.microsoft.com/updates?id=511898",
    "description": "Today, we are announcing the general availability of Azure Spot Placement Score, a feature that allows you to assess the likelihood of deployment success for your Spot virtual machines. Spot availability can vary across different combinations of Azure loc",
    "pubDate": "2025-10-14T15:00:50.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Choose an Analytical Data Store in Microsoft Fabric",
    "link": "https://learn.microsoft.com/azure/architecture/data-guide/technology-choices/fabric-analytical-data-stores",
    "description": "Evaluate analytical data store options in Microsoft Fabric based on data volumes, types, compute engine, ingestion, transformation, and query patterns.",
    "pubDate": "2025-10-14T14:46:49.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Greenfield lakehouse on Microsoft Fabric",
    "link": "https://learn.microsoft.com/azure/architecture/example-scenario/data/greenfield-lakehouse-fabric",
    "description": "Learn about a greenfield solution for creating a robust, scalable data platform by using the lakehouse design paradigm on Microsoft Fabric.",
    "pubDate": "2025-10-14T14:26:04.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[Launched] Generally Available: Azure Site Recovery support for Ultra Disks",
    "link": "https://azure.microsoft.com/updates?id=513518",
    "description": "Announcing the General Availability of Azure Site Recovery (ASR) support for Virtual Machines with Ultra Disks. This release enables organizations to replicate, failover, and failback virtual machines with Ultra Disks across Azure regions with minimal imp",
    "pubDate": "2025-10-14T10:30:39.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Accelerating open-source infrastructure development for frontier AI at scale",
    "link": "https://azure.microsoft.com/en-us/blog/accelerating-open-source-infrastructure-development-for-frontier-ai-at-scale/",
    "description": "<p>Microsoft is contributing new standards across power, cooling, sustainability, security, networking, and fleet resiliency to advance innovation.</p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/accelerating-open-source-infrastructure-development-for-frontier-ai-at-scale/\">Accelerating open-source infrastructure development for frontier AI at scale</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-14T00:35:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "Azure App Configuration Considerations for Multitenancy",
    "link": "https://learn.microsoft.com/azure/architecture/guide/multitenant/service/app-configuration",
    "description": "Learn about the features of Azure App Configuration that are useful when working with multitenant systems, and use the provided links for guidance and examples.",
    "pubDate": "2025-10-13T21:53:04.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Architecture Styles",
    "link": "https://learn.microsoft.com/azure/architecture/guide/architecture-styles",
    "description": "Learn about architecture styles for cloud applications, including descriptions, recommendations, best practices, and recommended deployment with Azure services.",
    "pubDate": "2025-10-13T20:35:06.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Microsoft Entra security for AWS",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/aws/aws-azure-ad-security",
    "description": "Learn how Microsoft Entra ID can help secure and protect Amazon Web Services (AWS) identity management and account access. Discover Microsoft security solutions.",
    "pubDate": "2025-10-13T20:34:27.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Azure Local Baseline Reference Architecture",
    "link": "https://learn.microsoft.com/azure/architecture/hybrid/azure-local-baseline",
    "description": "Learn how to design Azure Local for highly available virtualized and containerized workloads, focusing on reliability and security.",
    "pubDate": "2025-10-13T17:04:09.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Azure Local Storage Switchless Architecture",
    "link": "https://learn.microsoft.com/azure/architecture/hybrid/azure-local-switchless",
    "description": "Learn how to design Azure Local infrastructure by using a storage switchless architecture, with a focus on reliability, security, and hybrid workload management.",
    "pubDate": "2025-10-13T17:04:09.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[In preview] Public Preview: Environmental sustainability features in Azure API Management",
    "link": "https://azure.microsoft.com/updates?id=513074",
    "description": "Azure API Management now supports environmental sustainability features in public preview. These capabilities help organizations minimize the carbon footprint of their API infrastructure by making API traffic and policy behavior carbon-aware.With these ne",
    "pubDate": "2025-10-13T16:30:27.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: PostgreSQL 18 on Azure Database for PostgreSQL – Flexible Server ",
    "link": "https://azure.microsoft.com/updates?id=508403",
    "description": "You can now try PostgreSQL 18 in public preview on Azure Database for PostgreSQL – Flexible Server. PostgreSQL 18 introduces new performance, scalability, and developer productivity improvements. With this preview, you get early access to the latest commu",
    "pubDate": "2025-10-13T16:00:05.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Azure Custom Vision will be retired on September 25, 2028 ",
    "link": "https://azure.microsoft.com/updates?id=502914",
    "description": "Microsoft is announcing the planned retirement of the Azure Custom Vision service.  Microsoft will provide full support for all existing Azure Custom Vision customers until 9/25/2028. During this support window, customers are encouraged to begin planning ",
    "pubDate": "2025-10-13T16:00:05.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Advanced Azure Kubernetes Service (AKS) Microservices Architecture",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/containers/aks-microservices/aks-microservices-advanced",
    "description": "Learn about a scalable, secure AKS microservices architecture that builds on recommended AKS microservices baseline architectures and implementations.",
    "pubDate": "2025-10-13T15:55:05.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Run SAP BW/4HANA with Linux VMs",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/sap/run-sap-bw4hana-with-linux-virtual-machines",
    "description": "Learn about the SAP BW/4HANA application tier and how it's suitable for a high availability, small-scale production environment of SAP BW/4HANA on Azure.",
    "pubDate": "2025-10-13T15:38:30.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[In preview] Public Preview: Azure Integrated HSM",
    "link": "https://azure.microsoft.com/updates?id=503325",
    "description": "We\r\nare announcing the release of Azure\r\nIntegrated HSM, a Hardware Security Module (HSM) cache and crypto\r\naccelerator designed to enhance the security and performance of cryptographic\r\noperations in virtual machines. For customers who heavily rely on\r\ncrypto",
    "pubDate": "2025-10-13T15:30:40.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "FYAI: Why developers will lead AI transformation across the enterprise",
    "link": "https://www.microsoft.com/en-us/microsoft-cloud/blog/2025/10/13/fyai-why-developers-will-lead-ai-transformation-across-the-enterprise/",
    "description": "<p>Discover how developers are unlocking AI's full potential by using copilots and agents to reshape customer experiences and streamline operations.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/microsoft-cloud/blog/2025/10/13/fyai-why-developers-will-lead-ai-transformation-across-the-enterprise/\">FYAI: Why developers will lead AI transformation across the enterprise</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-13T15:10:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "[Launched] Generally Available: Microsoft Entra ID token refresh code samples in Python and .NET ",
    "link": "https://azure.microsoft.com/updates?id=508413",
    "description": "You can now access code samples for Entra ID token refresh using Python and .NET in Azure Database for PostgreSQL. These samples are designed to help you securely manage authentication tokens when connecting to your PostgreSQL database with Entra ID, ensu",
    "pubDate": "2025-10-13T15:00:46.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Stream Processing with Databricks",
    "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/data/stream-processing-databricks",
    "description": "Learn how to create a four-stage, end-to-end stream processing pipeline in Azure by using Azure Databricks.",
    "pubDate": "2025-10-10T15:16:38.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Extraneous Fetching antipattern",
    "link": "https://learn.microsoft.com/azure/architecture/antipatterns/extraneous-fetching",
    "description": "Learn about ways to mitigate the Extraneous Fetching antipattern, the common design flaw of fetching more data than needed for a business operation.",
    "pubDate": "2025-10-10T07:36:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Web API Implementation",
    "link": "https://learn.microsoft.com/azure/architecture/best-practices/api-implementation",
    "description": "Learn about best practices for implementing a web API and publishing it to make it available to client applications.",
    "pubDate": "2025-10-10T07:36:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Caching guidance",
    "link": "https://learn.microsoft.com/azure/architecture/best-practices/caching",
    "description": "Learn how caching can improve the performance and scalability of a system by copying frequently accessed data to fast storage close to the application.",
    "pubDate": "2025-10-10T07:36:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "CDN guidance",
    "link": "https://learn.microsoft.com/azure/architecture/best-practices/cdn",
    "description": "Guidance on using Content Delivery Networks (CDNs) to deliver high-bandwidth content hosted in Azure.",
    "pubDate": "2025-10-10T07:36:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Pricing models for a multitenant solution",
    "link": "https://learn.microsoft.com/azure/architecture/guide/multitenant/considerations/pricing-models",
    "description": "This article describes the considerations for planning pricing models for a multitenant solution.",
    "pubDate": "2025-10-10T07:36:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Data considerations for microservices",
    "link": "https://learn.microsoft.com/azure/architecture/microservices/design/data-considerations",
    "description": "Learn about managing data in a microservices architecture. Data integrity and data consistency are critical challenges for microservices.",
    "pubDate": "2025-10-10T07:36:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Interservice communication in microservices",
    "link": "https://learn.microsoft.com/azure/architecture/microservices/design/interservice-communication",
    "description": "Learn about the tradeoffs between asynchronous messaging versus synchronous APIs for communication between microservices and some challenges in communication.",
    "pubDate": "2025-10-10T07:36:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Bulkhead pattern",
    "link": "https://learn.microsoft.com/azure/architecture/patterns/bulkhead",
    "description": "Isolate elements of an application into pools so that if one fails, the others will continue to function.",
    "pubDate": "2025-10-10T07:36:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Gateway Aggregation pattern",
    "link": "https://learn.microsoft.com/azure/architecture/patterns/gateway-aggregation",
    "description": "Learn about the Gateway Aggregation pattern, which uses a gateway to aggregate many individual requests into a single request.",
    "pubDate": "2025-10-10T07:36:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Rate Limiting pattern",
    "link": "https://learn.microsoft.com/azure/architecture/patterns/rate-limiting-pattern",
    "description": "You can use a rate limiting pattern to help you avoid or minimize throttling errors.",
    "pubDate": "2025-10-10T07:36:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Resilient design guidance for Event Hubs and Functions",
    "link": "https://learn.microsoft.com/azure/architecture/serverless/event-hubs-functions/resilient-design",
    "description": "Learn how to develop resilient and scalable code that runs on Azure Functions and responds to Event Hubs events.",
    "pubDate": "2025-10-10T07:36:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Multi-Region App Service App Approaches for Disaster Recovery",
    "link": "https://learn.microsoft.com/azure/architecture/web-apps/guides/multi-region-app-service/multi-region-app-service",
    "description": "Learn about common approaches to deploy Azure App Service apps across multiple regions for disaster recovery purposes.",
    "pubDate": "2025-10-10T07:36:39.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "Natural Language Processing Technology",
    "link": "https://learn.microsoft.com/azure/architecture/data-guide/technology-choices/natural-language-processing",
    "description": "Choose a natural language processing service for sentiment analysis, topic and language detection, key phrase extraction, and document categorization.",
    "pubDate": "2025-10-09T18:00:12.000Z",
    "source": "Azure Architecture"
  },
  {
    "title": "[Launched] Generally Available: Custom port support for Azure Database for MySQL – Flexible Server ",
    "link": "https://azure.microsoft.com/updates?id=503627",
    "description": "You can now configure a custom port (25001–26000) during server creation for both public and private access-enabled servers—enabling you to integrate more easily with existing applications and improve alignment with security postures. By default, MySQL se",
    "pubDate": "2025-10-09T17:30:09.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[Launched] Generally Available: Azure Firewall updates - Customer provided public IP address support in secured hubs",
    "link": "https://azure.microsoft.com/updates?id=512875",
    "description": "Azure Firewall in Virtual WAN\r\nsecured hubs now supports the use of customer-provided public IP addresses.\r\nThis capability enables organizations to bring their own public IP addresses\r\nwhen deploying Azure Firewall in a secured Virtual WAN hub, providing gr",
    "pubDate": "2025-10-09T17:00:43.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Microsoft Azure delivers the first large scale cluster with NVIDIA GB300 NVL72 for OpenAI workloads",
    "link": "https://azure.microsoft.com/en-us/blog/microsoft-azure-delivers-the-first-large-scale-cluster-with-nvidia-gb300-nvl72-for-openai-workloads/",
    "description": "<p>Microsoft delivers the first at-scale production cluster with more than 4,600 NVIDIA GB300 NVL72, featuring NVIDIA Blackwell Ultra GPUs connected through the next-generation NVIDIA InfiniBand network. </p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/microsoft-azure-delivers-the-first-large-scale-cluster-with-nvidia-gb300-nvl72-for-openai-workloads/\">Microsoft Azure delivers the first large scale cluster with NVIDIA GB300 NVL72 for OpenAI workloads</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>\n",
    "pubDate": "2025-10-09T16:00:00.000Z",
    "source": "Azure Blog"
  },
  {
    "title": "[Launched] Generally Available: Firmware analysis enabled by Azure Arc ",
    "link": "https://azure.microsoft.com/updates?id=512201",
    "description": "Firmware analysis enabled by Azure Arc is now generally available. Firmware analysis brings deep visibility into the software that powers IoT/OT and network devices—systems that often operate as “black boxes” with limited insight into their security postu",
    "pubDate": "2025-10-09T14:15:20.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Azure AI Health Insights and related models",
    "link": "https://azure.microsoft.com/updates?id=502049",
    "description": " As part of a strategic review of our AI portfolio, Azure AI Health Insights service and the Clinical Trials Matcher and Radiology Insights models will be retired on December 31, 2025, and will no longer be available for use or integration. As a result, e",
    "pubDate": "2025-10-09T12:45:35.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "[In preview] Public Preview: Introducing Vaulted Backup for Azure Data Lake Storage",
    "link": "https://azure.microsoft.com/updates?id=508971",
    "description": "Announcing the Public Preview of Vaulted Backup\r\nfor Azure Data Lake Storage (ADLS)!Azure Backup now\r\nsupports vaulted protection for ADLS, delivering secure, off-site backups that\r\nensure business continuity and compliance—even in cases of accidental deleti",
    "pubDate": "2025-10-09T00:00:23.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Azure Cache for Redis Enterprise is retiring on March 30, 2027",
    "link": "https://azure.microsoft.com/updates?id=499606",
    "description": "Azure Cache for Redis Enterprise and Enterprise Flash tiers is retiring on March 31, 2027 and we recommend you migrate your workloads to use Azure Managed Redis by that date. Starting April 1, 2026, users will not be able to create new instances of Azure ",
    "pubDate": "2025-10-08T23:15:04.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Retirement: Azure Cache for Redis is retiring on September 30, 2028",
    "link": "https://azure.microsoft.com/updates?id=499577",
    "description": "Azure Cache for Redis (Basic, Standard and Premium) will be retired on September 30, 2028 and we recommend you migrate your workloads to use Azure Managed Redis before September 30, 2028. Azure Cache for Redis instances that are not migrated by September ",
    "pubDate": "2025-10-08T23:15:04.000Z",
    "source": "Azure Updates"
  },
  {
    "title": "Use AI Enrichment With Image and Text Processing",
    "link": "https://learn.microsoft.com/azure/architecture/solution-ideas/articles/ai-search-skillsets",
    "description": "Learn how to transform unstructured image and text data into full-text searchable content with Azure AI Search prebuilt skills and custom skills.",
    "pubDate": "2025-10-08T14:18:13.000Z",
    "source": "Azure Architecture"
  }
]